{"id":11,"text":"the strongest LLMs in this task16. The robust performance of Me-LLaMA showed potential in assisting challenging clinical applications. It is noticed that variations in test sizesand evaluation methods across different studies contribute to the observed dif-ferences in performance betweenGPT-4 in our paper and other studies. We also noted that both the Me-LLaMA-chat model and GPT-4 faced diffi-culties identifying the correct diagnosis within the top ranks, underscoring the difficulty of this task. Additionally, while the NEJM CPCs offer a rig-orous test for these models, they do not encompass the full range of a physician ’ s duties or broader clinical competence. Therefore, complex clinical diagnosis remains a challenging area that demands more effective models and improved evaluation benchmarks to better capture the com-plexities of real-world clinical scenarios. Our results also emphasize the importance of data diversity during model development. Our empirical results revealed that the PMC-LLaMA 13B model, which employed a data mix ratio of 19 : 1 between medical and general domain data, exhibited around 2. 7 % performance drop across both general and biomedical tasks. On the other hand, the Meditron models, 7B, Model performance in the complex clinical case diagnosis task under automatic evaluation. The figure presents the top-K accuracy ( where 1 K 5 ) of Me-LLaMA-70B-chat, ChatGPT, GPT-4, and LLaMA2-70B-chat on a complex clinical case diagnosis task, evaluated automatically. Model performance in the complex clinical case diagnosis task under human evaluation. The figure shows the top-1 and top-5 accuracy of Me-LLaMA /-70B-chat and GPT-4 in a complex clinical case diagnosis task, evaluated through human assessment. https : / / doi. org / 10. 1038 / s41746-025-01533-1 Article npj Digital Medicine | 8 : 141 4 and 70B, with a 99 : 1 mix ratio, demonstrated improvements in biomedical tasks, yet they still saw around 1 % declines in the performance of general tasks. In contrast, our models, which adopt a 4 : 1 ratio, have shown enhancementsintheirperformanceforbothgeneralandmedicaltasks. This suggests that the integration of general domain data","label":[[1401,1408,"MODEL"],[683,690,"MODEL"],[1259,1266,"MODEL"],[1442,1449,"MODEL"],[1530,1537,"MODEL"],[1675,1682,"MODEL"],[378,383,"MODEL"],[1410,1415,"MODEL"],[1664,1669,"MODEL"],[64,69,"MODEL"],[357,362,"MODEL"],[1007,1012,"MODEL"],[1385,1390,"MODEL"],[1643,1648,"MODEL"],[1013,1016,"MODEL"],[1348,1362,"TECHNIQUE"],[927,936,"TECHNIQUE"],[1622,1636,"METRIC"]],"Comments":[]}
