{"id":2,"text":". 5 % and 94. 0 % for ChatGPT-4 and Gemini, and time response is 2. 5 s for ChatGPT-4 and 2. 5 s for Gemini. Finally, this research indicates how NLP and LLMs can transform breast cancer recon struction by offering predictive insights and promoting tailored, patient-centered therapy, bridging the gap between powerful computational technologies and life science research to better patient care. 1. Introduction The prevalence of breast cancer is increasing globally. Breast cancer is the most dominant type of cancer affecting millions of cases world wide, surpassing lung cancer. Breast cancer ranks as the fourth most public cause of cancer-linked deaths worldwide which is the major cause of death among women. The reduction in breast cancer mortality can be achieved by the improvements in medical technology and the increased use of breast cancer screening methods. It nonetheless showed that breast cancer treatment expenditures would reach almost billions. There are numerous limitations in traditional methods, including the fact that they are single-center studies conducted by one surgeon and that surgical practice evolves with time and increased experience. LLMs, such as Transformer-based Language Models ( TLM ), determine abilities in understanding and generating text like humanscreated thu senabling real-time statements and providing appreciated insights to health care authorities. The swift advancement of Natural Language Processing ( NLP ) in creases the medical field ’ s curiosity about employing these methods to enhance the precision of cancer screening. Recently, the launch of ChatGPT ( OpenAI ) provides tailored training feedback to surgical trainees and supports research in breast reconstruction. LLMs are nonparametric models that utilize self-supervised learning and are trained on an extensive corpus of text data. They usually consist of a * Corresponding author. E-mail addresses : zcrao2011 @ 163. com ( C. Zheng ), RhiannaQ7472 @ 163. com ( Q. Li ), karelgl @ 163. com ( G. Lu ), m13509693025 @ 126. com ( Y. Mai ), 15815571318 @ 163. com ( Y. Hu ). journal homepage : www.. com / locate / slast https : / / doi. org / 10. 1016 / j. slast. 2025. 100285 Received 31 January 2025 ; Received in revised","label":[[1185,1196,"MODEL"],[22,31,"MODEL"],[76,85,"MODEL"],[22,29,"MODEL"],[76,83,"MODEL"],[1606,1613,"MODEL"],[1778,1797,"TECHNIQUE"],[1773,1797,"TECHNIQUE"],[1789,1797,"TECHNIQUE"],[1551,1560,"METRIC"],[596,601,"APPLICATION"]],"Comments":[]}
