{"id":1,"text":"Full Length Article Large language models in breast cancer reconstruction : A framework for patient-specific recovery and predictive insights Chunrao Zheng *, Qunfang Li, Geling Lu, Yuchang Mai, Yuan Hu Division of Breast Surgery, Department of General Surgery, Shenzhen People ’ s Hospital ( The Second Clinical Medical College, Jinan University ; The First Affiliated Hospital, Southern University of Science and Technology ), Shenzhen 518020, Guangdong, PR China A R T I C L E I N F O Keywords : Breast cancer reconstruction Natural language processing ( NLP ) Patient recovery Large language models ( LLMS ) Personalizing care A B S T R A C T Breast cancer reconstruction, a vital part of comprehensive cancer therapy, can be performed concurrently with cancer resection, improving both physical and psychological recovery for patients. However, the intricacy and variety of recovery demand a specialized strategy. Thus, a unique framework that uses Natural Language Pro cessing ( NLP ) and Large Language Models ( LLMs ) is developed to improve patient-specific recovery and pre dictive insights during breast cancer reconstruction. Lemmatization / Stemming is used for pre-processing large volumes of data from medical records, clinical notes, and treatment histories and BioBERT, a model pretrained on biomedical texts to capture complex medical terminology used for feature extraction and aids in the trans formation of text data into numerical vectors. The approach employs forecasting models like ChatGPT-4 and Gemini to offer insights into the likelihood of successful reconstruction and associated problems based on specific patient characteristics, treatment options, and recovery timelines. Using sophisticated LLMs, this framework provides clinicians with a powerful tool for personalizing care by anticipating postoperative complications, re covery durations, and psychosocial consequences. Furthermore, it allows for the development of targeted rehabilitation programs that are adapted to unique patient needs, enabling greater recovery and overall quality of life. This approach not only improves clinical decision-making but also empowers patients by offering personalized recovery strategies. As a result, the accuracy of ChatGPT-4 is 98. 4 % and Gemini is 98. 7 % ; the score per response is 2. 52 for ChatGPT-4 and 2. 89 for Gemini. Readability of ChatGPT-4 is 93. 0 % and Gemini is 94. 5 % ; a relevance score is 95","label":[[1507,1516,"MODEL"],[2242,2251,"MODEL"],[2323,2332,"MODEL"],[2370,2379,"MODEL"],[1278,1285,"MODEL"],[1337,1344,"MODEL"],[1521,1527,"MODEL"],[2267,2273,"MODEL"],[2347,2353,"MODEL"],[2395,2401,"MODEL"],[1374,1392,"TECHNIQUE"],[59,73,"TECHNIQUE"],[1175,1189,"TECHNIQUE"],[1138,1151,"TECHNIQUE"],[1154,1162,"TECHNIQUE"],[2230,2238,"METRIC"]],"Comments":[]}
