{"id":3,"text":"form 11 March 2025 ; Accepted 9 April 2025 Available online 10 April 2025 2472-6303 / © 2025 The Authors. Published by Inc. on behalf of Society for Laboratory Automation and Screening. This is an open access article under the CC BY-NC-ND license ( http : / / creativecommons. org / licenses / by-nc-nd / 4. 0 / ). substantial number of parameters, spanning from hundreds of millions to billions. Nonetheless, with the right prompts, LLMs can achieve remarkable performance on a variety of NLP tasks. In recent years, LLMs have progressed significantly. Recent advancements in computing power and model building have made these advanced models, which impose billions of constraints, possible. The potential LLMs might unlock better care for the patient through features such as assisted diagnosis, hasten medical science research through huge-scale literature re searches, and improve the efficiency of the health system through automation. The breast reconstruction can be performed either during the initial operation or following main surgery and oncological interventions. Further, surgical recommendations are provided by these LLM models for effective recovery. However, there is a need for personalized recovery insights and predictive analytics in breast cancer reconstruction. Hence, enhanced care tailored to the individual patient, and improved treatment planningare essential for better recovery of patients. 1. 1. Research objective This research aims to enhance patient-specific recovery outcomes following breast cancer reconstruction by developing a predictive framework that utilizes NLP and LLM. It includes ChatGPT-4 and Gemini model that would predict recovery success, postoperative issues, and psychosocial effects by processing and correlating immense volumes of medical data, such as clinical notes and treatment history, to offer tailored insights to therapists. This method employs recent computa tional technology to make available patient-specific recovery programs, facilitate optimal decision-making, design individualized rehabilitation programs, and improve treatment in general. 1. 2. Key contributions data gathered comprises of medical records, treatment his tory, and clinical notes. Data pre-processing involves Lemmatization, stemming, and feature extraction using BioBERT. ChatGPT-4 and Gemini are used to predict recovery success and complications. Predictions for recovery duration, and rehabilitation programs to improve recovery strategies. NLP and LLM models aim to improve recovery outcomes based on","label":[[2303,2310,"MODEL"],[1626,1635,"MODEL"],[2312,2321,"MODEL"],[1626,1633,"MODEL"],[2312,2319,"MODEL"],[2249,2262,"TECHNIQUE"],[2264,2272,"TECHNIQUE"]],"Comments":[]}
