{"id":2,"text":"##Ms by introducing the background, key findings, and mainstream techniques. In particular, we focus on four major aspects of LLMs, namely pre-training, adaptation tuning, utilization, and capacity evaluation. Furthermore, we also summarize the available resources for developing LLMs and discuss the remaining issues for future directions. This survey provides an up-to-date review of the literature on LLMs, which can be a useful resource for both researchers and engineers. Index Terms-Large Language Models ; Emergent Abilities ; Adaptation Tuning ; Utilization ; Alignment ; Capacity Evaluation 1 INTRODUCTION \" The limits of my language mean the limits of my world. \"-Ludwig Wittgenstein L ANGUAGE is a prominent ability in human beings to express and communicate, which develops in early childhood and evolves over a lifetime. Machines, however, cannot naturally grasp the abilities of understand-ing and communicating in the form of human language, unless equipped with powerful artificial intelligence ( AI ) algorithms. It has been a longstanding research challenge to achieve this goal, to enable machines to read, write, and communicate like humans. Technically, language modeling ( LM ) is one of the major approaches to advancing language intelligence of machines. In general, LM aims to model the generative likelihood of word sequences, so as to predict the probabilities of future ( or missing ) tokens. The research of LM has received Version : v16 ( major update on March 11, 2025 ). GitHub link : https : / / github. com / RUCAIBox / LLMSurvey Chinese book link : lmbook-zh. github. io * K. Zhou and J. Li contribute equally to this work. The authors are mainly with Gaoling School of Artificial Intelligence and School of Information, Renmin University of China, Beijing, China ; Jian-Yun Nie is with DIRO, Universit ́e de Montr ́eal, Canada. Contact e-mail : batmanfly @ gmail. com The authors of this survey paper reserve all the copyrights of the fig-ures / tables, and any use of these materials for publication purpose must be officially granted by the survey authors. extensive attention in the literature, which can be divided into four major development stages : Statistical language models ( SLM ). SLMs","label":[[568,577,"MODEL"],[477,482,"TECHNIQUE"]],"Comments":[]}
