{"id":4,"text":"are calculated using exact match by querying the keyphrases in title or abstract by months. We set different x-axis ranges for the two keyphrases, because \" language models \" have been explored at an earlier time. We label the points corresponding to important landmarks in the research progress of LLMs. A sharp increase occurs after the release of ChatGPT : the average number of published arXiv papers that contain \" large language model \" in title or abstract goes from 0. 40 per day to 8. 58 per day ( Statistical LM Neural LM Pre-trained LM LLM Task solving capacity 1990s 2013 2018 2020 Word2vec ( NPLM )! NLPS Static word representations Neural context modeling Solve typical NLP tasks n-gram models Statistical methods Probability estimation Assist in specific tasks ELMO! BERT! GPT-1 / 2 Context-aware representations Pre-training + fine-tuning Solve various NLP tasks GPT-3 / 4! ChatGPT! Claude Scaling language models Prompt based completion Solve various real-world tasks General-purpose task solver Specific task helper Task-agnostic feature learner Transferable NLP task solver An evolution process of the four generations of language models ( LM ) from the perspective of task solving capacity. Note that the time period for each stage may not be very accurate, and we set the time mainly according to the publish date of the most representative studies at each stage. For neural language models, we abbreviate the paper titles of two representative studies to name the two approaches : NPLM ( \" A neural probabilistic language model \" ) and NLPS ( \" Natural language processing ( almost ) from scratch \" ). Due to the space limitation, we don ’ t list all representative studies in this figure. various NLP tasks. Furthermore, word2vec was proposed to build a simplified shallow neural network for learning distributed word representations, which were demonstrated to be very effective across a variety of NLP tasks. These studies have initiated the use of language models for representation learning ( beyond word sequence modeling ), having an important impact on the field of NLP. Pre-trained language models ( PLM ). As an early at-tempt, ELMo was proposed to capture context-aware word representations by first pre-training a bidirectional LSTM ( biLS","label":[[420,440,"MODEL"],[594,602,"MODEL"],[1744,1752,"MODEL"],[350,357,"MODEL"],[890,897,"MODEL"],[879,884,"MODEL"],[776,780,"MODEL"],[2160,2164,"MODEL"],[2262,2266,"MODEL"],[782,786,"MODEL"],[547,550,"MODEL"],[788,791,"MODEL"],[1567,1594,"TECHNIQUE"],[843,854,"TECHNIQUE"],[21,32,"TECHNIQUE"],[1815,1823,"TECHNIQUE"],[684,687,"TECHNIQUE"],[869,872,"TECHNIQUE"],[1077,1080,"TECHNIQUE"],[1720,1723,"TECHNIQUE"],[1923,1926,"TECHNIQUE"],[2096,2099,"TECHNIQUE"]],"Comments":[]}
