{"id":14,"text":"##ms that they perceive to be relevant to the suspected diagnosis for which the scan is required, omitting other symptoms which may prove predictive. Such a limitation will often be present in such predictive modelling stud ies. However, if each patient were to have more clinical notes before the suspecting of lung cancer the effect of such bias may be reduced. Clinically, the absence of staging data restricts our insight into the model ’ s capacity to identify lung cancer at an early stage, which is crucial for understanding the impact of the predictions on patient outcomes. Addi tionally, the NER methods employed were not trained to extract genetic variants from pathology reports, spe cifically lung-cancer specific risk loci, which could fur ther improve the performance of the model. Beyond model development, the lack of other data sources restricts the comparisons that can be drawn to more con temporary methods. Many of the latest lung cancer pre diction models use data sources beyond symptoms and demographics, such as laboratory test results, imag ing, and genetic testing. Without access to such data, it is difficult to directly compare our model to such models. Future studies with access to more comprehen sive datasets could help address these limitations and further enhance the efficacy and generalisability of the developed predictive model. Conclusions This research highlights the potential of combining natural language processing and machine learning tech niques to enhance diagnostic criteria for lung cancer using unstructured healthcare data. The study ’ s key find ings include the successful identification of discriminat ing features associated with lung cancer diagnosis and achieving promising AUROC scores which outperform other comparable risk assessment tools. Such advance ments hold promise for improving patient care and out comes, albeit with a need to address certain limitations through the incorporation of primary care data for more comprehensive and unbiased criteria development. Abbreviations AUROC Area Under the Receiver Operating Characteristic curve COPD Chronic Obstructive Pulmonary Disease CT Computed Tomography CXR Chest X-ray EHR Electronic Health Record ICD 10-International Classification of Diseases NER Named Entity Recognition NHS National Health Service NLP Natural Language Processing NSCLC Non-Small Cell Lung Cancer SHAP Shapley Additive Explanations Receiver operating characteristic curves for the proposed method, QCancer and methods of Hamilton, when applied","label":[[1352,1368,"MODEL"],[15,23,"MODEL"],[1434,1461,"TECHNIQUE"],[2328,2355,"TECHNIQUE"],[1474,1482,"TECHNIQUE"],[2324,2327,"TECHNIQUE"],[602,605,"TECHNIQUE"],[2267,2270,"TECHNIQUE"],[1781,1796,"APPLICATION"],[673,690,"TECHNOLOGY"],[2389,2393,"TECHNOLOGY"],[2186,2189,"TECHNOLOGY"]],"Comments":[]}
