{"id":7,"text":"##ction. Feature selection Given the high dimensionality, with the number of symp tom features exceeding 12, 000, the dataset could not be analysed statistically. Instead, a genetic approach was taken. First, symptom features were removed where less than 0. 5 % of all patients or less than 5 % of lung cancer patients had the symptom documented in their notes. Thereafter, the remaining features were ranked according to their Bayesian importance value, calculated as : IMPTNB = | log ( p ( xi = 1 | yj = 1 ) ) −log ( p ( xi = 1 | yj = 0 ) ) | where xi and yj are 1-dimensional binary arrays indi cating the presence of featurei and diagnosis j for each patient. Following the ranking of all features, starting from the lowest ranking symptom, symptoms were removed should they have a Jaccard coefficient greater than 0. 8. Thereafter, the remaining symptoms were input into a tabu asexual genetic algorithm ( TAGA ), configured to select the feature set which maximises the area under the receiver operating characteristic curve ( AUROC ). TAGA was tasked with returning λ features, where λ is a number between 5 and 20. The rationale for capping the number of features included in a model at 20 was to ensure the interpretability of the final diagnostic criteria and to prevent overfitting. Model development and evaluation 20 % of the data was held out of the model development process and used as a test set, with the remaining 80 % being used for training and validation. For each model, a 5-fold cross-validation process was applied to select the most relevant features and identify the appropriate hyperparameters for the model, following which per formance was examined using the test set. Recognising that there are vastly more non-lung cancer patients in the dataset than lung cancer patients, there is the likeli hood that the model may not predict any patients as hav ing lung cancer to achieve a highly accurate performance. Therefore, in training the model, cost-sensitive learning was employed to assign a higher penalty to misclassify ing lung cancer patients compared to misclassifying non-lung cancer patients. The performance of the trained models was assessed using the following diagnostic test characteristics ; accuracy, sensitivity, and specificity, in addition to","label":[[1503,1519,"TECHNIQUE"],[9,26,"TECHNIQUE"],[1988,1996,"TECHNIQUE"],[2235,2243,"METRIC"],[2245,2256,"METRIC"],[2262,2273,"METRIC"],[402,408,"APPLICATION"],[678,685,"APPLICATION"],[728,735,"APPLICATION"]],"Comments":[]}
