{"id":3,"text":"aggressive nature of lung cancer, with delays in detection resulting in patients presenting with more advanced stages of the disease. Recent data published by the Office for National Statistics and Public Health England showed the 5-year survival rate among patients diagnosed with stage 1 lung cancer was 56. 6 %, with this figure reducing to only 2. 9 % among those diagnosed with stage 4 disease. Addi tionally, precise diagnostic criteria play a pivotal role in distinguishing lung cancer from a spectrum of cardiotho racic and respiratory conditions that may exhibit similar symptoms. With that said, to ensure the cost-effective ness and cost-benefit of targeted interventions aimed at improving the diagnosis of lung cancer, judicious alloca tion of resources is required. Electronic health records ( EHRs ) have revolutionized clinical research by offering a vast and comprehensive repository of patient information. Records encompass a range of data, including patient demographics, medi cal history, laboratory results, medication prescriptions, and procedure information. Such extensive and struc tured data enable researchers to conduct large-scale, population-based studies, aiding in the identification of trends, risk factors [ 6 – 8 ], and treatment outcomes. However, a significant limitation of EHRs per tains to accuracy and completeness, particularly among symptoms and diagnosis data. Symptoms and diagnoses are often documented in unstructured free-text clinical notes, requiring manual coding into clinical ontologies such as ICD-10 and SNOMED-CT. The process of clini cal coding can introduce inaccuracies and ‘ missingness ’ in the data, posing considerable challenges for clinical research. Considering these challenges, tech niques such as natural language processing ( NLP ) offer valuable solutions for not only mitigating the limitations of structured data but also unlocking valuable insights that may be exclusive to free-text narratives of patient encounters. Natural Language Processing ( NLP ) has gained util ity in extracting and analysing information in Electronic Health Records ( EHRs ). Koleck conducted a literature review, finding 27 relevant studies using NLP to analyse symptoms in EHR narratives. NLP has been used for auditing discharge reports, predicting read missions, and aiding in diagnosis [ 16 – 18 ]. Weissman used NLP to classify discharge documents based on critical illness-related keywords with high accu","label":[[1767,1794,"TECHNIQUE"],[1993,2020,"TECHNIQUE"],[1797,1800,"TECHNIQUE"],[2023,2026,"TECHNIQUE"],[2200,2203,"TECHNIQUE"],[2243,2246,"TECHNIQUE"],[2370,2373,"TECHNIQUE"],[1331,1339,"METRIC"],[49,58,"TECHNOLOGY"]],"Comments":[]}
