{"id":5,"text":"at scale, this study applies NLP to extract SNOMED-CT concepts from free-text notes, applies subsumption to elevate rarer symptoms up the ontological hierarchy, then feeds the final feature set into a machine learning framework to train a model to discriminate lung cancer from other diseases. Further more, this study provides an exploration into how feature weights might be affected by demographic information like age, sex and ethnicity. Methodology Eligibility Data were extracted from the Barts Health NHS Trust Data Warehouse for all patients meeting the follow ing eligibility criteria : Patients referred for a chest x-ray ( CXR ), aged 40 years or older at the point of referral, dur ing two time periods between 01 Jan 2016 and 31 Dec 2019 or 01 Jan 2022 and 31 Dec 2022 were eligible for inclusion. The time window of 01 Jan 2020 – 31 Dec 2021 was not considered due to deviations from the typical cancer care-pathways as a result of the COVID-19 pan demic. Patients who had opted out of their data being used for research, those without medical notes beyond four years from the original x-ray, unless a second con firmatory x-ray within four years ruled out lung cancer, and patients with an existing or historical diagnosis of any cancer were excluded from participation in the study. Data sources All free-text data contained in the secondary care EHR system, from one year prior to the date of the first chest X-ray, were extracted and combined with demo graphic information, including Age, Sex and Ethnicity, and ICD-10 data from the same time period. Addition ally, diagnostic data in the form of ICD-10 codes and the Somerset Cancer Registry were extracted for the subse quent four years post-CXR, or up to the maximum avail able timepoint. To determine the ground truth, a patient was labelled as having lung cancer if a diagnosis was recorded in the Somerset Cancer Registry, or an ICD-10 code of C34 ( Malignant neoplasm of bronchus and lung ) was present in the patient ’ s EHR post-CXR. Considering the potential delays in diagnoses, post-CXR, and the delays in upload ing this information onto the electronic health records system, model training was performed iteratively, each time re-labelling the ground truth to consider an addi tional","label":[[495,500,"MODEL"],[987,992,"MODEL"],[209,217,"TECHNIQUE"],[628,631,"TECHNOLOGY"],[1102,1105,"TECHNOLOGY"],[1139,1142,"TECHNOLOGY"],[1428,1431,"TECHNOLOGY"]],"Comments":[]}
