{"id":1,"text":"RESEARCH Open Access © The Author ( s ) 2024. Open Access This article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4. 0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author ( s ) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article ’ s Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article ’ s Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http : / / creati vecommons. org / licenses / by-nc-nd / 4. 0 /. Houston BMC Medical Informatics and Decision Making 24 : 371 https : / / doi. org / 10. 1186 / s12911-024-02790-y BMC Medical Informatics and Decision Making * Correspondence : Andrew Houston andrew. houston4 @ nhs. net Full list of author information is available at the end of the article Abstract Background The digitisation of healthcare records has generated vast amounts of unstructured data, presenting opportunities for improvements in disease diagnosis when clinical coding falls short, such as in the recording of patient symptoms. This study presents an approach using natural language processing to extract clinical concepts from free-text which are used to automatically form diagnostic criteria for lung cancer from unstructured secondary-care data. Methods Patients aged 40 and above who underwent a chest x-ray ( CXR ) between 2016 and 2022 were included. ICD-10 and unstructured data were pulled from their electronic health records ( EHRs ) over the preceding 12 months to the CXR. The unstructured data were processed using named entity recognition to extract symptoms, which were mapped to SNOMED-CT codes. Subsumption of features up the SNOMED-CT hierarchy was used to mitigate against sparse features and a frequency-based criteria,","label":[[1671,1698,"TECHNIQUE"],[214,221,"TECHNIQUE"],[1111,1122,"TECHNOLOGY"],[2298,2304,"TECHNOLOGY"],[1914,1917,"TECHNOLOGY"]],"Comments":[]}
