{"id":2,"text":"combined with univariate logarithmic probabilities, was applied to select candidate features to take forward to the model development phase. A genetic algorithm was employed to identify the most discriminating features to form the diagnostic criteria. Results 75002 patients were included, with 1012 lung cancer diagnoses made within 12 months of the CXR. The best-performing model achieved an AUROC of 0. 72. Results showed that an existing ‘ disorder of the lung ’, such as pneumonia, and a ‘ cough ’ increased the probability of a lung cancer diagnosis. ‘ Anomalies of great vessel ’, ‘ disorder of the retroperitoneal compartment ’ and ‘ context-dependent findings ’, such as pain, statistically reduced the risk of lung cancer, making other diagnoses more likely. The performance of the developed model was compared to the existing cancer risk scores, demonstrating superior performance. Conclusions The proposed methods demonstrated success in leveraging unstructured secondary-care data to derive diagnostic criteria for lung cancer, outperforming existing risk tools. These advancements show potential for enhancing patient care and results. However, it is essential to tackle specific limitations by integrating primary care data to ensure a more thorough and unbiased development of diagnostic criteria. Moreover, the study highlights Automated derivation of diagnostic criteria for lung cancer using natural language processing on electronic health records : a pilot study Andrew Houston1, 2 *, Sophie Williams1, 2, William Ricketts3, Charles Gutteridge1, Chris Tackaberry4 and John Conibear5 Page 2 of 10 Houston BMC Medical Informatics and Decision Making 24 : 371 Background Lung cancer stands as one of the most common and seri ous types of cancer, ranking 2nd in terms of new cases and 1st in terms of mortalities, according to global statis tics from 2020. The most recent statistics show that, in England, only 29. 4 % of lung cancer cases are identified at stages 1 and 2, underscoring the critical need for improved diagnostic criteria and detection methods to enhance the chances of successful treatment and reduce the burden of this disease on patients and healthcare sys tems. Recognising this urgency, the NHS has a long-term plan to diagnose 75 % of all lung cancers at stages 1 and 2 by 2028, aiming to significantly improve early detection rates and patient outcomes. Early diagnosis is imperative given the","label":[[1764,1771,"APPLICATION"],[2060,2069,"TECHNOLOGY"]],"Comments":[]}
