{"id":4,"text":"racy. Greenwald developed an NLP tool to extract readmission-related concepts and achieved comparable performance to existing prediction mod els. In oncology, NLP extracted features from CT reports for predicting lymph node metastasis in non-small cell lung cancer ( NSCLC ) with competitive perfor mance. Despite its potential, there ’ s a gap in applying NLP to oncology symptoms, highlighting an opportunity for further research. While NLP has demonstrated its effectiveness in vari ous healthcare applications, there is a growing recogni tion of the advantages of extracting ontological concepts rather than use-case-specific concepts. This approach provides a more generalised framework for understanding and organising medical information, contributing to interoperability and facilitating the linkage with already coded, structured, clinical data found in the EHR. This transition to ontological con cept extraction aligns with the broader adoption of stan dardised medical terminologies like SNOMED CT, which play an important role in structuring and organizing clin ical data for improved healthcare decision-making and research. From a machine learning perspective, extraction of concepts from a hierarchical ontology offers a crucial advantage, enabling the retention of valuable informa tion, even when a patient reports rarer or more spe cific symptoms. For instance, when a patient mentions a symptom like a ‘ chesty cough ’, machine learning sys tems can link it to a higher-level concept in the ontology, such as \" cough. \" This hierarchical relationship allows the model to preserve the broader context and meaning of the symptom, preventing the loss of nuanced informa tion that might occur in non-hierarchical concept lists, where rare features might otherwise be removed. Failure the importance of contextualising SNOMED-CT concepts into meaningful terminology that resonates with clinicians, facilitating a clearer and more tangible understanding of the criteria applied. Keywords Electronic health records, Natural language processing, Cancer, Diagnostics, SNOMED-CT, Machine learning, Genetic optimisation Page 3 of 10 Houston BMC Medical Informatics and Decision Making 24 : 371 to account for such sparsity could result in poor or unre liable classification performance. Given the promise of NLP for the accurate extraction of relevant features,","label":[[2029,2056,"TECHNIQUE"],[1206,1218,"TECHNIQUE"],[1154,1162,"TECHNIQUE"],[29,32,"TECHNIQUE"],[159,162,"TECHNIQUE"],[357,360,"TECHNIQUE"],[439,442,"TECHNIQUE"],[2317,2320,"TECHNIQUE"],[2162,2173,"TECHNOLOGY"],[187,197,"TECHNOLOGY"]],"Comments":[]}
