{"id":8,"text":"the calculation of the AUROC, with AUROC acting as the primary evaluation measure. Given the highly imbalanced nature of the task, balanced accuracy was also calculated, with balanced accuracy defined as the sum of sensitivity and specificity divided by two. This study considered the following classification mod els : Logistic Regression, Mixed Naïve Bayes, and Deci sion Trees. The rationale for the selection of these models lies in their interpretability and ease of application. Comparison with existing risk tools To determine whether the proposed method improves the diagnosis of lung cancer beyond that of existing methods that make use of similar features, a compari son with existing risk tools was performed. The pro posed method was compared against the lung cancer component of the QCancer score and the lung cancer-related risk assessment tools listed on the Cancer Research UK website. In applying the QCancer score, the publicly avail able weights were used, and the score calculated on the same test set used for all previous comparisons. The risk assessment tools ( RATs ) of Hamilton are solely a set of feature combinations and their associated positive predictive values. Therefore, to apply the RATs to the data used in this body of work, a logistic regres sion model was trained for each feature combination, using the training set used for all previous experiments, returning the probability of lung cancer for each patient in the test set. Thereafter, the highest probability of all feature combinations was regarded as the final predic tion for each patient. As before, the AUROC was used to compare the models, and DeLong ’ s test was applied to statistically compare the ROC curves. Bonferroni correction was used to account for multiple comparisons. Results Demographic information In total, 75, 002 patients ( 35628 female ) were included in this study. The study population had a mean age of 63 years 14 years. 36, 123 identified as ‘ White ’, 20, 219 iden tified as ‘ Asian ’, 7851 identified as ‘ Black ’, 3330 identified as ‘ Other ’ and 835 identified as ‘ Mixed Ethnicity ’. Data for sex was missing in two patients, and ethnicity data was missing in 6644 patients, both of which were imputed. Page 5 of 10 Houston BMC Medical Informatics and Decision Making 24 : 371 In total, over the 12-month observation period after the first C","label":[[320,339,"MODEL"],[140,148,"METRIC"],[184,192,"METRIC"],[215,226,"METRIC"],[231,242,"METRIC"],[131,148,"METRIC"],[175,192,"METRIC"],[838,853,"APPLICATION"],[1061,1076,"APPLICATION"]],"Comments":[]}
