{"id":3,"text":"##al Pulmonary Nodules ( IPN ). An adequate management of IPN, supported by widely accepted recommendations, could lead to a stage shift from late to early-stage disease, and represent a great opportunity to improve lung cancer outcomes. But large population based studies are lack-ing and the literature is heterogeneous regarding adherence to FUP guidelines [ 8−12 ]. A better IPN related knowledge could allow us to evaluate the expected benefits of organized programs of IPN Abbreviations : IPN, Incidental Pulmonary Nodule ; FUP, Follow-Up ; NLP, Natural Lan-guage Processing ; BERT, Bidirectional Encoder Representations from Transformers ; HCL, Lyon University Hospital * Corresponding author. E-mail address : emmanuel. grolleau @ chu-lyon. fr ( E. Grolleau ). https : / / doi. org / 10. 1016 / j. resmer. 2024. 101136 2590-0412 / © 2024 The Authors. Published by Masson SAS. This is an open access article under the CC BY license ( http : / / creativecommons. org / licenses / by / 4. 0 / ) Respir. Med and Res 86 101136 Available online at www.. com management, as it has been suggested by the recent work of Osaro-giagbon. In this study, we aimed to assess the prevalence of IPN and related FUP outcomes in a large French hospital-based population, through Bidirectional Encoder Representations from Transformers ( BERT )-based Natural Language Processing ( NLP ) detection of nodules in CT reports. NLP is a subset of computer sciences and artificial intelli-gence, using computational technique to learn, understand, and pro-duce human language content. The use of contextual embedding method allows to better understand the sentence ’ s meaning, and to study more complex concepts. Especially, BERT is a pre-trained NLP framework that has shown promising results on a variety of NLP tasks. Our primary endpoint was the assessment of IPN prevalence over one year and the associated FUP rate through healthcare database analysis. We also aimed to describe the main","label":[[1678,1685,"MODEL"],[583,587,"MODEL"],[1326,1330,"MODEL"],[1708,1712,"MODEL"],[1339,1366,"TECHNIQUE"],[547,550,"TECHNIQUE"],[1369,1372,"TECHNIQUE"],[1411,1414,"TECHNIQUE"],[1730,1733,"TECHNIQUE"],[1793,1796,"TECHNIQUE"],[632,644,"TECHNOLOGY"],[1311,1323,"TECHNOLOGY"],[1375,1384,"TECHNOLOGY"],[1399,1409,"TECHNOLOGY"],[879,882,"TECHNOLOGY"]],"Comments":[]}
