{"id":6,"text":"\" Pulmonary interstitial micro-nodule \", \" Intrapulmonary lymph node \" or when no nodule was identified. The same NLP workflow was then applied on the impression sec-tion to determine whether the radiologist who originated the report mentioned the presence of a nodule in the conclusion. To evaluate the performance of the NLP algorithm we selected a random sample of 475 ( 0. 5 % ) patients from our study dataset. We compared the nodule identification findings between NLP algo-rithm and physician review of reports. 2. 5. Nodule characteristics We performed a keyword analysis using Microsoft Excel version \" 2206 Build 16. 0. 15330. 2021600 on the text of the CT reports ( all key-words are available in supplemental material, Table S1 ). According to this keyword analysis on the database of patients with a pulmonary nodule identified by the NLP algorithm, those with a history of cancer or nodule mentioned in their CT report were removed from the analysis. We determined if there was a mention of the nodule in the impression section, if the nodule was related to COVID-19, and its attenuation, through keyword analysis. We assumed that nodules with no specified attenuation were solids. We defined a COVID-19 related CT as any CT performed in a context of microbiologically proven COVID-19, or suspected COVID-19. Nodule size and location were collected by manual review of all the reports with IPN. In case of multiple nodules, the size of the larg-est one was retained. In case of single nodule, we reported the lobe in which it was located. Multiple nodules were reported as such, with-out specification of their location. 2. 6. Follow-up ( FUP ) We used the international coding system for medical procedures and diagnoses ICD-10 ( International Statistical Classification of Dis-eases and Related Health Problems 10th Revision ) to collect the infor-mation regarding patients ’ FUP, from January 1, 2020, to December 31, 2021. Information related to cancer diagnosis and common cancer diagnostic investigations were targeted. Information regarding the occurrence","label":[],"Comments":[]}
