{"id":2,"text":"and radiological features associated with FUP. Methods : We trained a Natural Language Processing ( NLP ) tool to identify the transcripts mentioning the presence of a pulmonary nodule, among a large population of patients from a French hospital. We extracted nodule characteristics using keyword analysis. NLP algorithm accuracy was determined through manual reading from a sample of our population. Electronic health database and medical record analysis by clinician allowed us to obtain information about FUP and cancer diagnoses. Results : In this retrospective observational study, we analyzed 101, 703 transcripts corresponding to the entire CTs performed in 2020. We identified 1, 991 ( 2 % ) patients with an IPN. NLP accuracy for nodule detec-tion in CT reports was 99 %. Only 41 % received a FUP between January 2020 and December 2021. Patient age, nodule size, and the mention of the nodule in the impression part were positively associated with FUP, while nodules diagnosed in the context of COVID-19 were less followed. 36 ( 2 % ) lung cancers were subse-quently diagnosed, with 16 ( 45 % ) at a non-metastatic stage. Conclusions : We identified a high prevalence of IPN with a low FUP rate, encouraging the implementation of IPN management program. We also highlighted the potential of NLP for database analysis in clinical research. © 2024 The Authors. Published by Masson SAS. This is an open access article under the CC BY license ( http : / / creativecommons. org / licenses / by / 4. 0 / ) Keywords : Incidental pulmonary nodule Natural language processing Artificial intelligence Radiology reports Follow-up 1. Introduction Lung cancer is the second most common cancer and the leading cause of cancer related deaths worldwide, accounting for 18 % of all cancer related deaths. A recent French study highlighted that non-small cell lung cancer ( NSCLC ) is diagnosed at a metastatic stage in 60 % of the cases, thus preventing from the outset any curative intent. Studies on Lung Cancer Screening ( LCS ) have paved the way to earlier diagnosis and showed improvement in lung cancer outcomes [ 3−6 ]. However, pulmonary nodules are most often discovered inci-dentally, outside of LCS. These nodules, detected in patients with no history of cancer are called Incident","label":[[70,97,"TECHNIQUE"],[1548,1575,"TECHNIQUE"],[100,103,"TECHNIQUE"],[307,310,"TECHNIQUE"],[722,725,"TECHNIQUE"],[1300,1303,"TECHNIQUE"],[321,329,"METRIC"],[726,734,"METRIC"],[1600,1617,"TECHNOLOGY"],[760,770,"TECHNOLOGY"],[1388,1391,"TECHNOLOGY"]],"Comments":[]}
