{"id":11,"text":"yet not really explored. With our NLP-based detection method coupled with healthcare software database interrogation, we obtained a FUP rate of 41 %. When considering only the nodules 6 mm, the FUP rate increased to 45 %. Blagev and col-leagues reported that 29 % of IPN discovery led to further evaluation when nodules were discovered in pulmonary angiograms, especially Performance of our NLP algorithm to identify IPN on the study dataset. Value CI95 % Sensitivity 97. 8 % ( 44 / 45 ) 94 %-100 % Specificity 99. 3 % ( 427 / 430 ) 98 %-100 % Positive Predictive Value 93. 6 % ( 44 / 47 ) 87 %-100 % Negative Predictive Value 99. 8 % ( 427 / 428 ) 99 %-100 % Accuracy 99. 2 % ( 471 / 475 ) 97 %-99 % Flowchart depicting the outcome after incidental pulmonary nodule detection. HCL : Lyon university Hospital. E. Grolleau, S. Couraud, E. Jupin Delevaux Respiratory Medicine and Research 86 101136 4 when they were mentioned in the impression section. Iqbal studied the impact of the terminology used by radiologists to report IPN on FUP. They showed that only 41 % of the nodules resulted in a subsequent FUP. In a retrospective cohort study using NLP to identify nodules in CT reports, Lee reported that 61 % of the patients were followed. Among patients with inadequate FUP a majority had delayed surveillance. We did not study here the adequacy between timely recommended FUP and actual work-up. In this work, we highlighted different factors associated with patient FUP. A Higher FUP rate was observed in the 50−75 years-old group whereas older patients are under-represented in the FUP group ( This trend might be driven by the lower comparison of patients ’ and nodules ’ characteristics in univariate analysis, between the followed and unfollowed patients. SD : standard deviation, COVID-19 : coronavirus disease 2019, IPN : Incidental Pulmonary Nodule, FUP : Follow-UP. FUP N = 808 % No FUP N = 1183 % p Age ( mean § SD ) 63. 76 § 16","label":[[34,37,"TECHNIQUE"],[391,394,"TECHNIQUE"],[1148,1151,"TECHNIQUE"],[456,467,"METRIC"],[499,510,"METRIC"],[660,668,"METRIC"],[750,776,"APPLICATION"],[44,53,"TECHNOLOGY"],[1175,1185,"TECHNOLOGY"]],"Comments":[]}
