{"id":4,"text":"characteristics of IPN in our population and to assess factors associated with the occurrence of FUP. Finally, we evaluated the accuracy of our NLP algorithm through a manual review of radiology reports. This study was con-ducted during COVID-19 era. 2. Methods 2. 1. Study population We retrospectively identified individuals who had at least one CT at Lyon University Hospital ( HCL ) during the period from January 1, 2019, to December 31, 2020. CT reports from 2019 were used to train and validate the NLP model. All the CT performed at HCL ( regardless of the anatomical zone explored ), from January 1, 2020, to December 31, 2020, were included in our study. Radiology reports were semi-structured, with 4 sections, according to the European recommenda-tion. 2. 2. Ethic The privacy policy of HCL has been respected. Patient data were considered as anonymous by our local ethic committee, therefore with no need of individual consent. The present study was registered at the « Commission Nationale de l ’ Informatique et des Libertes » ( CNIL ) under the number 21 _ 5853. 2. 3. NLP algorithm The NLP algorithm was trained to identify the reports describing the presence of a pulmonary nodule. To train our model, we first extracted all the sentences from the \" findings ’ ’ section of each CT report of the 2019 training dataset. It resulted in 1, 007, 000 independent sentences. Among these senten-ces, 52, 300 were randomly selected and labeled by a clinician and a radiologist according to their semantic meaning. The labels were ‘ Non-Thoracic \", \" Healthy Thoracic \" and \" Pathological Thoracic \" related sentence. This latest category was then labeled according to the pathological feature described in the sentence : \" Pulmonary embolism \", \" Non-embolic pulmonary artery pathology \", \" Heart abnormality \", \" Mediastinal lymphadenopathy \", \" Bronchial disor-ders \", \" Interstitial syndrome \", \" Pleural abnormality \", \" Thoracic wall abnormality ’, \" Aortic dissection \", \" Aortic aneurysm \", \" Aortic Ather-oma \", \" Aortic U","label":[[168,181,"TECHNIQUE"],[144,147,"TECHNIQUE"],[506,509,"TECHNIQUE"],[1085,1088,"TECHNIQUE"],[1103,1106,"TECHNIQUE"],[128,136,"METRIC"],[185,202,"TECHNOLOGY"],[665,682,"TECHNOLOGY"],[449,459,"TECHNOLOGY"]],"Comments":[]}
