{"id":10,"text":"##1 ). Marginally signifi-cant association between nodule size ( > 10 mm ) and FUP was observed ( OR = 1. 53, 95 % CI 1. 14−2. 05, p = 0. 004 ). In contrary, CT per-formed in a context of COVID-19 were associated with a lower pro-portion of FUP ( OR = 0. 62, 95 % CI 0. 49−0. 79, p < 0. 001 ). Patients over 75 years-old were less likely to be followed, although the threshold for significance was not reached ( OR = 0. 75, 95 % CI 0. 57−0. 98, p < 0. 033 ). Other variables were not significantly associated with the likelihood of FUP in our model. 4. 6. Cancer In our population, we identified 127 cancer cases ( Lung cancer diagnosis was more frequent among patients with a FUP in comparison to their counterpart ( 37 % and 10 % respectively ). Detailed characteristics of patients with a cancer diagnosis are avail-able in Among lung cancer patients, 44 % were diagnosed with a lung adenocarcinoma, 33 % with a squamous cell carcinoma ( SCC ), 11 % with a small cell lung cancer and 11 % with other histological types ( Sixteen ( 44 % ) were diagnosed at a non-metastatic stage ( Discussion We trained a BERT-based NLP algorithm to detect pulmonary nod-ules on CT reports and demonstrated its high accuracy in processing a large database with 98 % sensitivity and 99 % specificity. The perfor-mance of our NLP tool is comparable to those reported in previously published works [ 19−21 ]. IPN prevalence was 2 % among all CT reports of 2020, with a FUP rate of 41 % in the study period. Patient age, nodule size and the mention of the nodule in the impression part were significantly associated with FUP in multivariate analysis, while nodules related to COVID-19 were less followed. IPN prevalence in the European population is poorly known. In the literature, this prevalence depends on the CT type, ranging from < 10 % for abdominal CT, to almost 50 % for chest CT angiograms. The FUP rate of IPN was","label":[[1108,1112,"MODEL"],[1202,1210,"METRIC"],[1252,1263,"METRIC"],[1273,1284,"METRIC"]],"Comments":[]}
