{"id":5,"text":"of multiscale and multimodal KGs that capture mechanis-tic knowledge in the context of neurological disorders. We encoded it in BEL because it is appropriate for qualitative causal, correlative and associative relationships between biological entities, processes and measurements across modes and scales. However, it is currently suffering from the issues we have previously described : it has not been assessed for confidence, is becoming outdated and needs to be enriched following a rational approach that best prioritizes the flood of recent literature. To address this, we have developed and applied two workflows, described in this paper : the first is for re-curating existing BEL documents to ensure their syntac-tic and semantic correctness in a scenario where there was neither prior syntax validation, curation guidelines for entity nomenclature nor a second curator for achieving inter-annotator agreement. The second is a semi-automated algorithm and reproducible workflow for updating and rationally enriching an existing KG that lessens the burden of identifying relevant literature, reduces the overhead, as defined by Rodríguez-Esteban, and generates more, higher quality, relevant content. We applied these workflows to a selection of KGs in NeuroMMSig and evaluated the curation effort ( time ) and quality in comparison to purely manual curation and other previously reported semi-automated curation workflows. We increased the number of nodes and edges in the selected KGs respectively by approximately five and seven times while maintaining the specificity of the KGs. With an improvement to the content underlying NeuroMMSig, the mechanism enrichment algorithm on its corresponding web service can return more correct and robust results to support the analysis of neuroimaging and genomics data for clinical trials in Alzheimer ’ s disease, Parkinson ’ s disease and epilepsy. Finally, we have made this workflow freely available at https : / / github. com / bel-enrichment / bel-enrichment so others can include it in their own curation workflows. Methods We first present the re-curation workflow for syntactic and semantic quality assurance before presenting our proposed approach for updating and rational enrichment. Syntactic quality assurance We developed a workflow using git ( https : / / git-s","label":[[2224,2243,"TECHNIQUE"],[1350,1365,"TECHNIQUE"],[892,907,"METRIC"],[1567,1578,"METRIC"],[2303,2306,"TECHNOLOGY"],[2321,2324,"TECHNOLOGY"]],"Comments":[]}
