{"id":9,"text":"add the annotation SET Confidence = \" High \". AETIONOMY were all produced before 2015, the entities that were curated using their labels ( instead of stable iden-tifiers ) needed to be updated. A short investigation showed that HGNC and GO were the least stable namespaces ( e. g. change of preferred label, splitting of entries, merging of entries and deprecation of entries ), but combined they had less than 100 entities to be addressed. We therefore concluded that manual intervention was more appropriate than developing complicated systems for updating labels. While it is not intended to be the focus of this article, we have also begun to build a custom terminology ( available at https : / / github. com / pharmacome / terminology ) to sup-plement the publicly available ones for a small number ( less than 1000 ) of terms that had not been included in other resources. After ensuring both the correctness of BEL syntax and namespace usage, a remaining major aspect of re-curation is to address the issues arising from curation lacking inter-annotator agreement. BEL statements and their correspond-ing annotations ( metadata ) were generated by several inde-pendent curators and had not undergone quality control either by comparison with the results of independent cura-tion of the same document by a second curator or even minimally checked by a second curator. We applied the following simple guidelines : 1. Second curator : check and label all relevant statements with a SET Confidence annotation using the Likert scale as described in Third curator ( curation leader ) : after all relevant statements had been checked for correctness, check all statements with SET Confidence = \" High \" or SET Confidence = \" Medium \". Change the confidence to SET Confidence = \" Very High \" on agreement. Otherwise, fix the statement. The existence of the confidence guideline can be checked with the PyBEL command line interface with the following command : pybel compile--required-annotations \" Confidence \". Proposed approach for updating and rational enrichment Next, we developed and applied a procedure for enriching a given BEL document in order to cope with the mounting issues of out of dateness and incompleteness. Our approach identifies nodes with low information density and uses a large-scale corpus of biomedical literature that","label":[[2046,2065,"TECHNIQUE"],[1045,1060,"METRIC"],[1901,1906,"TECHNOLOGY"],[1959,1964,"TECHNOLOGY"]],"Comments":[]}
