{"id":13,"text":"enrichment template generated by INDRA for the first 30 prioritized genes. Curators worked 10 hours per round for 1 month ( 4 weeks ; 1 round per week ) to curate BEL statements from a pool of 113 genes. A database of statements Downloaded from https : / / academic. oup. com / database / article / doi / 10. 1093 / database / baz068 / 5521414 by guest on 30 October 2025 Database, Vol. 2019, Article ID baz068 Page 7 of 13 A workflow for syntactic quality assessment. This figure can be found on FigShare at https : / / doi. org / 10. 6084 / m9. figshare. 7643006. v1. was generated by INDRA using the REACH and Sparser readers to extract a total of 17096 statements containing these genes from all MEDLINE abstracts and PubMed Central full-text articles available in August 2018. Of these, 2989 were manually evaluated. A total of 917 statements ( 30. 7 % ) were marked as correct by the curators, 1454 statements ( 48. 6 % ) required manual corrections and the remainder ( 20. 7 % ) could not be corrected. The criteria for correctness was that ‘ all ’ aspects of the statement, including the subject and object entities, relationship type, phosphorylation and other post-translational modifications, were extracted to the same extent as careful manual curation could. Ultimately, excluding the statements that could not be corrected, 79. 3 % of the automatically extracted, manually revised BEL statements were recovered. After curation, the recovered statements were converted into a BEL KG that contained 4228 nodes and 17002 edges complementary to the original 10 subgraphs selected from NeuroMMSig. The discrepancies in the number of INDRA statements to BEL statements are due to the ontological reasoning process that occurs during conversion. For example, INDRA statements about protein complex formation are converted to bi-directional BEL statements, INDRA statements about post-translationally modified proteins induce edges to the reference protein and INDRA statements about bound proteins create a variety of additional BEL nodes representing their constituents and membership edges connecting them. There are two main aspects that are commonly used to formally evaluate a biocuration work","label":[[1797,1804,"MODEL"],[722,728,"DATASET"],[700,707,"DATASET"]],"Comments":[]}
