{"id":3,"text":"representations ( 20 – 22 ). Second, they are generally an incomplete repre-sentation of the current state of scientific knowledge due to the large amount of uncurated, unstructured knowledge in the literature. Third, they progressively become out of date as scientific experimentation and investigation elucidate new knowledge. Finally, they often lack biological contextual information such as organelle, cell, cell line, tissue, organ, phenotype or disease specificity. KGs also suffer from issues in the normalization and mapping of entities. Though interoperability standards and resources like the Minimal Information Required in the Annotation of Models [ MIRIAM ; ] and Identifiers. org have been developed and implemented to promote the semantic interoperability of biological models ( and by extension, KGs ), curators often encounter concepts that are not present in high-quality, publicly available terminologies and cannot capture the incident knowledge in a semantically meaningful way. These situations require enriching previously existing terminologies or, in some cases, developing new ones. For situations when the appropriate concept / term is unclear, several tools have been developed and made freely available to the community to help curators build semantically interoperable models including the Ontology Lookup Service [ OLS ; ], the Ontology Mapping Service ( OxO ; https : / / www. ebi. ac. uk / spot / oxo ), Zooma ( https : / / www. ebi. ac. uk / spot / zooma ) and CEDAR Workbench. Further, recent work from Domingo-Fernández on mapping pathways between major databases and a critical assessment of their over-laps and contradictions has shown that the adoption of standards like MIRIAM has been slow and that while the syntax of the varying formats used by each database may be correct, their semantic interoperability is still lacking. Motivation Accurately structuring and formalizing the unstructured knowledge in the biomedical literature requires careful planning and manual effort from trained curators. The scope of a given project must be defined based on its scientific goals ( e. g. to support the interpretation of data, to generate a disease-specific knowledgebase etc. ) and limited in its literature content sources ( e. g. abstracts, full text, patents etc. ) based on a project-specific metric for quality and relevance-","label":[[508,521,"TECHNIQUE"],[1360,1376,"TECHNIQUE"],[460,471,"METRIC"]],"Comments":[]}
