{"id":17,"text":". This issue has since been fixed. In general, the direct / indirect distinction is difficult to detect automatically in natural language, though it is very important in the generation of mechanistic and mathematical models arising from biological knowledge. In we present a small sampling of the errors and corresponding suggestions for improvement in the reading systems. We present a much more thorough enumeration of the errors found in statements for the 113 curated genes in the supplementary information. Besides generating new content quickly, this curation procedure includes informa-tion to allow for the evaluation of the automated relation extraction systems and for the proposition of improve-ments. For example, new groundings can be proposed for entities that were often mismatched. A prominent example was the misidentification of tau ( a human protein ) and taurine ( an amino acid ). Additionally, new rules could be suggested for rule-based systems to avoid issues with the misidentification of the order of the subject and object as in the example of ‘ Bak expression was also induced in cells overexpressing the stress-induced transcription factor GADD153, but Bak expression was inhibited in cells expressing an antisense GADD153 construct ’ whose use of the passive voice may have caused REACH to interpret the statement as ‘ Bak increased GADD153 ’. Ultimately, we believe we can use these examples to provide useful feedback to the developers of the reading systems and improve future extraction. After applying the re-curation workflow to our selec-tion of KGs in the NeuroMMSig inventory, we increased the number of nodes from 1188 to 1704 (. 5 ) and edges from 3529 to 5391 (. 5 ). After applying the enrichment workflow, the number of nodes increased to 5850 ( ) and edges to 23811 ( ). A more granular summary can be found in With a 5 increase in nodes, we would expect to see a 10 increase in edges if the new nodes were completely disconnected from the pre-existing nodes in the KG, which shows that we have been able to maintain the specificity of the KGs to a reasonable degree. In total, our curators spent 80 hours Downloaded from https : / / academic. oup. com / database / article / doi / 10. 1093 / database / baz068 / 5521","label":[[643,662,"TECHNIQUE"],[2066,2077,"METRIC"]],"Comments":[]}
