{"id":16,"text":"##L in order to identify common mistakes and to assist in the improvement of these three systems. The results showed that the most common error is caused by the name entity recognition sys-tem that identifies the entities participating in the relation ( Other common errors arose from the improper assignment of the subject and object entities, from evidences that did not actually include relations between the subject and object entities and statements that were semantically incorrect due to a negation word ( e. g. not, no, none, neither etc. ). Downloaded from https : / / academic. oup. com / database / article / doi / 10. 1093 / database / baz068 / 5521414 by guest on 30 October 2025 Database, Vol. 2019, Article ID baz068 Page 9 of 13 The frequencies of common errors found while curating BEL statements generated from 113 genes. Further details about each error type and the annotation process are available in the guidelines available at https : / / github. com / pharmacome / curation / blob / master / indra-errors. rst. The five curators were tasked with tagging interesting examples of the common mistakes that could be used to inform the development of the reading systems ( REACH, Sparser etc. ) and the assembly systems ( INDRA and PyBEL ). Because the authors of this manuscript maintain the INDRA and PyBEL packages, identifying the causes of errors in assembly was relatively straightforward. For example, BEL statements containing biological processes were consistently output using invalid BEL syntax, includ-ing the activity ( ) function, which is reserved for proteins and other physical entities. We addressed this by updating the previously mentioned indra. assemblers. PybelAssembler class. Another error type that was not addressed until after the evaluation was completed was the determination of the role of direct physical interaction in causal relations. INDRA makes use of linguistic cues from the text mining systems along with information from protein – protein interaction databases to determination if a relation involves a physical interaction between proteins, but this information was not incorporated into the indra. assemblers. PybelAssembler class. Instead, by default all relations were output using BEL statements implying physical contact : ‘ directly increases ’ ( i. e. increases via contact ) and directly decreases ( i. e. decreases via contact )","label":[],"Comments":[]}
