{"id":1,"text":"© The Author ( s ) 2019. Published by Oxford University Press. Page 1 of 13 This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( http : / / creativecommons. org / licenses / by / 4. 0 / ), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited. ( page number not for citation purposes ) Database, 2019, 1 – 13 Original article Original article Re-curation and rational enrichment of knowledge graphs in Biological Expression Language Charles Tapley Hoyt 1, 2, *, Daniel Domingo-Fernández 1, 2, Rana Aldisi 1, 2, Lingling Xu 1, 2, Kristian Kolpeja 1, Sandra Spalek 1, Esther Wollert 1, John Bachman 3, Benjamin M. Gyori 3, Patrick Greene 3 and Martin Hofmann-Apitius 1, 2 1Department of Bioinformatics, Fraunhofer Institute for Algorithms and Scientific Computing ( SCAI ), Sankt Augustin 53754, Germany, 2Bonn-Aachen International Center for Information Technology, Rheinische Friedrich-Wilhelms-Universität Bonn, Bonn 53115, Germany, and 3Laboratory of Systems Pharmacology, Harvard Medical School, 200 Longwood Ave, 02115 Boston, MA, USA * Corresponding author : Tel : + 49 2241 14-2268 ; Fax : + 49 2241 14-2656 ; Email : charles. hoyt @ scai. fraunhofer. de Citation details : Hoyt, C. T., Domingo-Fernàndez, D., Aldisi, R. Re-curation and rational enrichment of knowledge graphs in Biological Expression Language. Database Vol. 2019 : article ID baz068 ; Received 31 January 2019 ; Revised 3 April 2019 ; Accepted 29 April 2019 Abstract The rapid accumulation of new biomedical literature not only causes curated knowledge graphs ( KGs ) to become outdated and incomplete, but also makes manual curation an impractical and unsustainable solution. Automated or semi-automated workflows are necessary to assist in prioritizing and curating the literature to update and en","label":[[482,501,"TECHNIQUE"],[1366,1385,"TECHNIQUE"],[1715,1730,"TECHNIQUE"]],"Comments":[]}
