{"id":7,"text":"], Medical Subject Headings [ MeSH ; ], the Disease Ontology [ DO ; ], the Human Phenotype Ontology [ HPO ; ], the Cell Line Ontology, the Experimental Factor Ontology and others. Additionally, Selventa provided several entity type-specific, manually curated terminologies for chemicals, protein families, protein complexes and diseases for entities that had not yet been included in any of the other existing resources. Because the Selventa terminologies are no longer maintained and the publicly available terminologies have far surpassed them in coverage, the first step in re-curation was to normalize entities to high-quality, publicly available terminologies. For example, chemicals were normalized to identifiers from ChEBI, ChEMBL and PubChem whenever possible ; protein families and complexes were normalized to FamPlex ; and diseases were normalized to DO and HPO. Further, because the BEL documents from Downloaded from https : / / academic. oup. com / database / article / doi / 10. 1093 / database / baz068 / 5521414 by guest on 30 October 2025 Page 4 of 13 Database, Vol. 2019, Article ID baz068 Statistics for the number of BEL nodes and BEL statements in the 10 KGs selected from the NeuroMMSig inventory before re-curation ( using the version last updated on 6 December 2016 ), after re-curation and after enrichment Label Description Before re-curation After re-curation After enrichment Nodes Edges Nodes Edges Nodes Edges Tau protein subgraph The downstream effects of the post-translational modification, aggregation and transport of the Tau protein 191 493 261 733 708 2054 DKK1 subgraph, GSK3 subgraph The interaction partners with GSK-3β and its targets of post-translational modification. The complementary DKK1 pathway is a specific signaling cascade upstream of GSK-3β 128 254 174 377 376 1165 Inflammatory response Processes related to inflammation in the context of Alzheimer ’ s disease 182 373 341 743 2003 7607 Insulin signal transduction The molecular relationships between insulin resistance and inflammation, motivated by epidemiological studies that suggested a correlation between Alzheimer ’ s disease","label":[[549,557,"METRIC"],[732,738,"DATASET"]],"Comments":[]}
