{"id":12,"text":"Correct ’ column. 3. Else if the BEL statement can be improved ( e. g. assignment of entity types, relation etc. ), correct it and place an ‘ x ’ in the ‘ Changed ’ column and annotate the error type in the ‘ Error Type ’ column using a controlled vocabulary ( see the supplementary data ). Additional guidelines for categorizing error types can be found at https : / / github. com / pharmacome / curation / blob / master / indra-errors. rst. 4. Else if the BEL statement does not correspond to the ‘ Evidence ’ column and cannot be improved, then ‘ x ’ should neither be placed in the ‘ Correct ’ nor the ‘ Changed ’ column. 5. If the ‘ Evidence ’ column contains other BEL statements that were not extracted, duplicate the current row ’ s provenance ( reference, evidence etc. ) and add the addi-tional BEL statements. Place an ‘ x ’ in the ‘ Changed ’ column but not the ‘ Correct ’ column. 6. If there are other BEL statements that can be extracted, make a new line with all of the same provenance infor-mation ( uuid, reference, evidence etc. ) and just place an ‘ x ’ in the ‘ Changed ’ column. This procedure was applied iteratively : as the low infor-mation density nodes from the first round gained new rela-tions, the KG was expanded and further low information density nodes were added. There are several improvements that could be made to the information density function and prioritization of the resulting extracted statements. For example, relations found by INDRA between low infor-mation density nodes and high information density nodes could be prioritized to maintain the scope and focus of a KG. Results and discussion While applying the re-curation workflow outlined in we identified large sections of poor-quality cura-tion that had to be removed. Additionally, some evidences in the BEL document that were previously incompletely curated were completed. Re-curation also required the updating of namespaces from the 2015 versions to the most current and necessitated some additional revisions. To evaluate the enrichment workflow outlined in we defined weekly curation rounds in which each of the 5 curators were tasked to curate the","label":[[424,429,"TECHNOLOGY"],[1474,1479,"TECHNOLOGY"]],"Comments":[]}
