{"id":10,"text":"has been pre-processed by automated relation extraction methods to identify the most relevant literature, evidences and ulti-mately relations. Notably, the previously described quality assurance ( i. e. re-curation ) workflows for checking and addressing the syntactic and semantic correctness of a given BEL document were necessary to decrease the noise input into the procedure. Following the re-curation of the 10 Neu-roMMSig subgraphs, we applied the following procedure for rational enrichment : 1. KG pre-processing : nodes corresponding to the same gene ( i. e. RNA, microRNA, protein and variants thereof ) are collapsed, non-causal relationships ( e. g. correlative, associative, ontological etc. ) are removed and several entity types ( i. e. abundances, reactions, pathologies and biological processes ) are removed. While non-causal relations may be useful for explo-ration and in some analyses of a KG, their removal results in a graph of genes and their causal interrelations that allow the following enrichment steps to prioritize genes based on the amount of causal information available, which is required for several standard algorithms for analyzing experimental data such as Reverse Causal Reasoning. Further, the removal of other entity types and the collapsing of genes and their corresponding products were motivated by the focus of such algorithms on interactions between genes and their products. These pre-processing steps could be modified to fit other downstream applications. For example, the entity filter could be modified to include reactions and metabolites if the downstream application were to investigate metabolic flux. Downloaded from https : / / academic. oup. com / database / article / doi / 10. 1093 / database / baz068 / 5521414 by guest on 30 October 2025 Page 6 of 13 Database, Vol. 2019, Article ID baz068 2. Application of information density metric : the remain-ing nodes are ranked by an information density func-tion. We used the sum of the node in-degree and out-degree as this corresponds to the amount of causal information for a given gene that is available in the KG. In this scenario, isolated nodes correspond to genes for which there is no causal information about its interactions with other proteins, and leaves ( i. e. entities with only one edge ) correspond to","label":[[479,498,"TECHNIQUE"],[507,521,"TECHNIQUE"],[1428,1442,"TECHNIQUE"]],"Comments":[]}
