{"id":18,"text":"##414 by guest on 30 October 2025 Page 10 of 13 Database, Vol. 2019, Article ID baz068 Examples of errors that resulted in suggestions for improvements for the underlying relation extraction systems Gene Evidence Issue Suggestion MRC1 In conclusion, these results suggest that BCR and ABL kinase abrogates MMR activity to inhibit apoptosis and induce mutator phenotype. MRC1, also known as MMR, was confused with mismatch repair ( MMR ) Machine learning methods generating contextual word embeddings could be used to improve the named entity recognition component such as NeuralCoref ( https : / / github. com / huggingface / neuralcoref ). TIMP1 In our work, the restoration of cholesterol efflux capacities from EPA-enriched human monocyte-derived macrophages ( HMDM ) treated with both the adenylate cyclase activator forskolin and the phosphodiesterase inhibitor IBMX strongly suggests that EPA decreased the ABCA1 mediated cholesterol efflux from HMDM through a PKA dependent pathway. TIMP1, also known as EPA, was confused with eicosapentaenoic acid ( EPA ) Improve the named entity recognition ( disambiguation ) process, for example, by updating synonym dictionaries in rule-based systems. TRPV1 Moreover, recently TRPV1 has been demonstrated to be either inhibited or activated by PIP 2. Only the inhibition relationship was extracted Rule-based relation extraction systems could be appended with new rules to handle sentences with multiple objects. This and similar examples could be included in the training data for machine learning-based relation extraction. NUMB This interaction is mediated by the NPXY motif of LNX1 and leads to ubiquitination of Numb by the RING domain of LNX1, thereby targeting Numb to proteasomal degradation. The complex sentence structure of ‘ ubiquitination ’ and ‘ targeting ’ event were not resolved properly, and the ubiquitination was omitted. Rule-based systems like REACH that explicitly handle ubiquitination events could be appended with new rules. USF2 Taken together, the results shown in suggest that USF2 stimulate","label":[[1751,1758,"MODEL"],[171,190,"TECHNIQUE"],[1355,1374,"TECHNIQUE"],[1551,1570,"TECHNIQUE"],[445,453,"TECHNIQUE"]],"Comments":[]}
