{"id":8,"text":"( AD ) and type II diabetes. 251 739 315 881 612 1973 Amyloidogenic subgraph The downstream effects of the amyloid precursor protein ( APP ), its protein modifiers and its cleavage products 493 1223 652 1751 2090 7436 Non-amyloidogenic subgraph Chemicals and processes known to down-regulate the expression of the transcript corresponding to APP or the abundance of the APP protein 195 359 325 635 795 2238 Apoptosis and cell death Processes relevant to AD that result in apoptosis including the Caspase subgraph, XIAP subgraph and Complement system subgraph 104 143 170 229 1065 2401 Acetylcholine subgraph Pathways including biological entities and processes related to cholinergic neurons and acetylcholine transmission 106 197 148 337 423 1275 GABA subgraph Pathways including biological entities and process related to GABAergic neurons and GABA transmission 21 30 91 190 305 721 Reactive oxygen species subgraph The effects of reactive oxygen species, including the Myeloperoxidase subgraph, Hydrogen peroxide subgraph, Free radical formation subgraph and Nitric oxide subgraph 104 173 126 224 1401 6277 Total 1188 3529 1704 5391 5850 23 811 Later, we discuss these statistics in terms of INDRA statements-the discrepancies are due to the ontological reasoner applied in the conversion process from INDRA statements to BEL statements. Downloaded from https : / / academic. oup. com / database / article / doi / 10. 1093 / database / baz068 / 5521414 by guest on 30 October 2025 Database, Vol. 2019, Article ID baz068 Page 5 of 13 Confidence annotations using the Likert scale for re-curation Confidence Rationale None If the evidence string is nonsense or contains no reasonable biological knowledge, delete it and the related statements entirely. It is okay to remove BEL statements that are not supported. Low If it ’ s not clear what BEL should represent the biology, add SET Confidence = \" Low \" for later discussion. Medium If the statement is wrong, fix it and add the annotation SET Confidence = \" Medium \". High If statement can be asserted from the given evidence,","label":[[1195,1200,"TECHNOLOGY"],[1305,1310,"TECHNOLOGY"]],"Comments":[]}
