{"id":11,"text":"nodes that have very limited information. 3. Automated relation extraction : the top-ranked genes are used as a query to a KG generated by large-scale auto-mated biological relation extraction. We used the Inte-grated Network and Dynamical Reasoning and Assem-bler [ INDRA ; ] and applied several filters to find the most relevant and novel relations. First, the relations that were already curated and in the KG were excluded. Second, INDRA was used to calculate a confidence score ( between 0. 0 and 1. 0 ) for each relation based on evidences from structured databases and the frequency of occurrence of similar statements. Those statements with a low confidence score ( < 0. 80 ) were removed to increase the precision and therefore reduce the curation overhead. While INDRA integrates relations extracted from multiple reading systems, a corpus of relations from a single machine reading system, such as EVEX, would serve the same purpose. 4. Conversion to BEL : different automated relation extrac-tion systems present various information ( e. g. entity off-sets, events, triggers etc. ) in ways that are not amenable to curation. Because INDRA already normalizes this information for several systems to several varieties of the indra. Statement Python class, we developed a converter to BEL using PyBEL that can be used directly with the indra. assemblers. PybelAssembler Python class. Finally, this information is exported to an Excel sheet with several additional columns for tracking INDRA statement provenance, curator provenance, the correctness of BEL statements, the type of errors found and the changes made to incorrect BEL statements. Examples and links to the full results can be found in the supplementary information. This process often results in the addition of entities that were excluded during KG pre-processing, such as biological processes and pathologies, as well as the inclusion of additional namespaces based on their corresponding priorities encoded in the converter. For each round of rational enrichment, the procedure was applied to generate several curation sheets correspond-ing to the lowest information genes. Each row was checked with the following procedure : 1. Place an ‘ x ’ in the ‘ Checked ’ column. 2. If the BEL statement correctly corresponds to the ‘ Evi-dence ’ column, place an ‘ x ’ in the ‘","label":[[55,74,"TECHNIQUE"],[173,192,"TECHNIQUE"],[713,722,"METRIC"],[85,91,"APPLICATION"],[921,926,"TECHNOLOGY"]],"Comments":[]}
