{"id":5,"text":"automate the extraction and structuring of information from the pathology reports. The primary algorithm used is the Generative Pre-trained Transformer ( GPT ), integrated into a custom-built Stream-lit. io web application. Streamlit. io, an open-source plat-form, was chosen for its ability to facilitate rapid develop-ment of generative AI applications. This platform allowed for the direct use of our GitHub profile and an inte-grated development environment ( IDE ) through GitHub Codespaces, enabling coding in a browser without local IDE installations as showing in This setup supports coding and deploying directly on Streamlit. io ’ s servers, streamlining the development process by eliminating the need for traditional deployment pipelines. Prototype and Algorithm Integration The user interface of the prototype is a straightforward single-page application ( SPA ), emphasizing simplicity and ease of use. The front-end development began by import-ing essential libraries like streamlit for app framework and pandas for data manipulation. The main function of the Streamlit app ( main ) encapsulates all functionalities, includ-ing file uploading and data processing controls. An Excel file uploader was implemented to allow users to input their pathology reports, which are then processed into a panda ’ s DataFrame for data structuring. The code structure is dis-played in API Integration and Data Processing The selection of GPT-3. 5 over other LLMs such as BERT or BioBERT was driven by GPT-3. 5's superior performance in understanding and generating complex language patterns, crucial for processing the nuanced language found in medical pathology reports. Compara-tive studies have shown that GPT-3. 5 provides enhanced context capture and coherence in generating textual inter-pretations, which is vital for the accurate extraction and structuring of data from unstructured medical texts. These capabilities make GPT-3. 5 particularly adept at handling Screenshot demonstrating the free-text format of a pathology report ( example from Taipei Medical University ) Journal of Medical Systems 49 : 36 36 Page 4 of 16 the specialized vocabulary and varied syntactical struc-tures prevalent in pathology reports. Integration with the OpenAI API uses the GPT-3. 5 model, managed through environment","label":[[140,151,"MODEL"],[1480,1487,"MODEL"],[1566,1573,"MODEL"],[1439,1444,"MODEL"],[1502,1507,"MODEL"],[1710,1715,"MODEL"],[1931,1936,"MODEL"],[2268,2273,"MODEL"],[1472,1476,"MODEL"],[154,157,"MODEL"],[64,81,"TECHNOLOGY"],[1257,1274,"TECHNOLOGY"],[1654,1671,"TECHNOLOGY"],[2208,2225,"TECHNOLOGY"],[1020,1026,"TECHNOLOGY"]],"Comments":[]}
