{"id":11,"text":"extraction of data but also demonstrates a robust method for handling diverse pathology data types, from macroscopic to microscopic details, ancillary stud-ies and accurate pathological staging. Initially, the study utilized the Text-Davinci-003 model, progressing through iterative enhancements to adopt the GPT-3. 5 Turbo-0125 model due to its advanced capabilities in generating struc-tured sentence responses. The transition was guided by a necessity for higher accuracy and the obsolescence of earlier models. The integration of Regex was initially considered to refine data extraction but was ultimately abandoned to avoid complications from merging different technological functions. Throughout the study, we faced practical challenges such as managing API rate limits and optimizing cost efficiency, which were crucial in sustain-ing the functionality of the AI systems used. These opera-tional challenges highlighted the importance of choosing the right model and refining extraction methodologies to balance performance and cost. The adoption of a struc-tured approach to prompt design significantly improved the precision of data extraction. This process involved choosing appropriate models, designing tailored prompts and refining response strategies to ensure the outputs met the required standards for clinical and research applica-tions. Moreover, the study provided insights into practi-cal and procedural elements of pathology, such as the differentiation between core biopsies and mastectomy specimens and the importance of detailed tumor docu-mentation. These aspects are critical for accurate clinical Core biopsy or not core biopsy ( A ). Distribution of core biopsy specimen laterality in reports, categorized as Right or Left ( B ). Measurements of specimen length and width across reports ( C ). Recorded specimen thickness in reports ( D ). Three-dimensional measurements ( length, width, thickness ) of two specimens ( E ). Pres-ence of deep fascia in biopsy specimens indicated in reports ( F ). Tis-sue composition in specimens, showing inclusion of skin, muscle, nipple, or none ( G ) Journal of Medical Systems 49 : 36 36 Page 10 of 16 assessments and enhancing the understanding of tumor characteristics. However, the study still has many limi-tations. Our study only utilized clinical records from a single healthcare system, lacking validation from external institutions. The specificity to breast cancer pathology reports may restrict the generalizability of the findings to other types of","label":[[309,312,"MODEL"],[309,314,"MODEL"],[466,474,"METRIC"],[1123,1132,"METRIC"],[2410,2421,"METRIC"],[691,701,"METRIC"]],"Comments":[]}
