{"id":9,"text":"##m to successfully extract four major types of information from free-text pathology reports : Macroscopic Information, Microscopic Information, Ancillary Studies and Pathologi-cal Staging Information. The prototype, integrating the GPT model within a Streamlit web application, demonstrated its capability to accurately parse and structure complex pathol-ogy data from free-text reports. Macroscopic Information Extraction The extraction of Macroscopic Information involved ana-lyzing Specimen Laterality and Tumor Site. For Speci-men Laterality, out of 33 reports, 15 were identified as User Interface Export Excel File Journal of Medical Systems 49 : 36 Page 7 of 16 36 core biopsy reports. We determined the laterality for each, with 8 specimens from the right breast and 7 from the left. Our analysis included assessing specimen dimensions and tissue composition, including skin, nipple and skeletal muscle presence. These detailed findings are crucial for understanding the pathological context of each specimen and extracted data is visualized in Figs. 9 and 10. Microscopic Information Extraction Microscopic Information provided insights into tumor focality, dimensions, histological type and grade. We meticulously extracted data on single versus multiple tumor foci, the size of the largest tumor focus and detailed histo-logical classifications, which are pivotal for diagnostic and Study framework System Architecture Journal of Medical Systems 49 : 36 36 Page 8 of 16 Journal of Medical Systems 49 : 36 Page 9 of 16 36 treatment decisions. Notably, errors in extraction, such as misinterpretations of tumor distance and position from a manual review, underscored the challenges of parsing com-plex medical texts. These findings were complemented by visual representations in Figs. 11 and 12, enhancing our understanding of tumor characteristics. Ancillary Studies The extraction of Ancillary Studies focused on hormone and protein receptor statuses crucial for treatment planning. This included detailed assessments of Estrogen Receptor ( ER ), Progesterone Receptor ( PR ) and HER2 statuses displayed in which are fundamental biomarkers in breast can-cer. The accuracy of these extractions was verified through manual reviews, ensuring the reliability of the data for clini-cal use. Pathological Staging Information Our AI prototype effectively extracted comprehensive patho-logical staging information, including the size and extent of primary tumors ( pT ), regional lymph node involvement ( p","label":[[233,236,"MODEL"],[341,348,"MODEL"],[2175,2183,"METRIC"]],"Comments":[]}
