{"id":20,"text":"CC BY Key words prediction PubMed Central 10, 000 CC BY Causal Relation Detection PubMed35 2450 CC BY Relation Extraction UMLS knowledge graph2 10, 000 Openrail Clinical QA, summarization, classification, mortality prediction MIMIC-III20, MIMIC-IV21 30, 000 PhysioNet credentialed health data use agreement 1. 5. 0 https : / / doi. org / 10. 1038 / s41746-025-01533-1 Article npj Digital Medicine | 8 : 141 7 whether each diagnosis from the model ’ s differential diagnosis list matched the gold standard final diagnosis, consistent with these prior studies. Existing studies27 have shown that LLM-based automatic calculation of top-K accuracy is comparable to human evaluation. Besides automatic evalua-tion, we had a clinician specializing in internal medicine perform a manual evaluation of top-k accuracy ( k = 1, 5 ). For more details on data processing, automatic evaluation, and human evaluation, see the Supplementary Information. Evaluation settings We evaluated Me-LLaMA at two evaluation settings including zero-shot and supervised learning to evaluate their performance and generalization ability across various tasks compared to baseline models. Supervised learning In the supervised learning setting, we evaluated Me-LLaMA 13 / 70B base models ’ performances adapted to downstream tasks. We conducted the task-specific finetuning on Me-LLaMA base models ( Me-LLaMA task-specific ) with each training set of assessed datasets in and then assessed the performance of Me-LLaMA task-specific models on test datasets. We employed the AdamW optimizer. For datasets with fewer than 10, 000 training samples, we fine-tuned the models for 5 epochs, while for larger datasets, the fine-tuning was conducted for 3 epochs. A uniform learning rate of 1e-5 was used across all datasets. Our baseline models including LLaMA2 Models ( 7B / 13B / 70B ) 6 : they are open-sourced LLMs released by Meta AI. PMC-LLaMA 13B2 is a biomedical LLM continually pre-trained on biomedical papers and medical books.","label":[[975,980,"MODEL"],[1231,1236,"MODEL"],[1350,1355,"MODEL"],[1373,1378,"MODEL"],[1482,1487,"MODEL"],[1906,1911,"MODEL"],[1817,1823,"MODEL"],[1032,1051,"TECHNIQUE"],[1159,1178,"TECHNIQUE"],[1186,1205,"TECHNIQUE"],[102,121,"TECHNIQUE"],[1618,1628,"TECHNIQUE"],[1685,1696,"TECHNIQUE"],[1543,1548,"TECHNIQUE"],[1043,1051,"TECHNIQUE"],[635,643,"METRIC"],[800,808,"METRIC"],[205,225,"APPLICATION"],[174,187,"APPLICATION"],[27,33,"DATASET"],[226,232,"DATASET"],[239,245,"DATASET"],[72,81,"TECHNOLOGY"]],"Comments":[]}
