{"id":7,"text":"overfitting and variance, using moder-ately tuned hyperparameters for peak performance. 26 We chose the hyperparameter set with moderate parameter tuning to maximise model performance and trained an RF model with the same feature-label pairs from the training set to build a classifier. We performed a random search combined with fivefold cross-validation to determine the optimal parameters for SVC, KNN and RF methods. Random hyperparameter search randomly selects values from predefined ranges or distributions to evaluate model performance. This is typi-cally done using techniques such as k-fold cross-validation, where the training set is further divided into k-folds, and the model is trained and evaluated on different subsets of data, with each fold used as the validation set once. Then the model is trained and tested multiple times with different hyperparameter values to obtain an estimate of its performance. 27 28 Overview of the natural language processing pipeline. T, true label ; F, false label of clinical notes. BMJ Health & Care Informatics : first published as 10. 1136 / bmjhci-2023-100966 on 1 July 2024. Downloaded from https : / / informatics. bmj. com on 11 April 2025 by guest. Protected by copyright, including for uses related to text and data mining, AI training, and similar technologies. 4 Park JI, BMJ Health Care Inform 2024 ; 31 : e100966. Open access We used the NLTK library29 for text cleaning, Scikit-Learn for data splitting, TF-IDF vectorisation, predictive modelling ( SVC, KNN and RF ), random search with cross-validation and evaluation and the Gensim library for Word2Vec and Doc2Vec implementation. 30 Model evaluation We used three commonly used performance metrics for model evaluation : precision, recall and area under the receiver operating characteristic curve ( AUC ). Preci-sion gauges the model ’ s accuracy in predicting positive Word2Vec and Doc2Vec algorithms ( Wi represents i-th word in a given text ). CBOW, continuous bag of words ; DBOW, distributed bag of words ; DM, distributed memory. BMJ Health & Care Informatics : first published as 10. 113","label":[[1610,1618,"MODEL"],[1888,1896,"MODEL"],[401,404,"MODEL"],[1518,1521,"MODEL"],[945,972,"TECHNIQUE"],[339,355,"TECHNIQUE"],[601,617,"TECHNIQUE"],[1551,1567,"TECHNIQUE"],[302,315,"TECHNIQUE"],[1532,1545,"TECHNIQUE"],[1420,1433,"TECHNIQUE"],[1475,1488,"TECHNIQUE"],[1468,1474,"TECHNIQUE"],[1738,1747,"METRIC"],[1824,1834,"METRIC"],[1856,1864,"METRIC"],[1749,1755,"METRIC"],[1817,1820,"METRIC"],[1435,1447,"TECHNOLOGY"],[1051,1062,"TECHNOLOGY"],[1591,1597,"TECHNOLOGY"],[1401,1405,"TECHNOLOGY"]],"Comments":[]}
