{"id":17,"text":"NLP tasks that involve different clinical note classifications, based on its fully automated end-to-end design. This suggests that the approach we developed has potential for broader appli-cations in various clinical NLP tasks beyond breast cancer treatment outcomes. CONCLUSION In this study, we developed a high-performance NLP pipeline that accurately discerns treatment outcomes of invasive breast cancer in under-represented women, highlighting previously overlooked disparities in care. Emphasising the significance of document-based text vectorisation, our method notably leveraged the TF-IDF and Doc2Vec models. Coupled with the superior perfor-mance of ensemble methods, especially the RF classifier, we could effectively navigate complex clinical notes. Despite challenges like lower recall rates in some clas-sifiers, the adaptable design of our pipeline signifies its potential for broader clinical NLP applications beyond just breast cancer outcomes. Future research should validate its scalability and generalisability across diverse healthcare datasets. Contributors JIP is responsible for the overall content as guarantor. The conceptualisation of the study was led by JIP and DK. The methodology was developed by JIP and DK. The validation of the study ’ s findings was conducted by JIP and JWP. The formal analysis and investigation were carried out by JIP. JIP and KZ provided the essential resources. Data curation was handled by JIP. The original draft was prepared by JIP, with review and editing contributions from JWP, DK and KZ. Visualisation efforts were undertaken by JIP and DK. Supervision and project administration were overseen by JIP. All authors have read and agreed to the published version of the manuscript. Funding The authors have not declared a specific grant for this research from any funding agency in the public, commercial or not-for-profit sectors. Competing interests None declared. Patient consent for publication Not applicable. Ethics approval The study was approved by the Institutional Review Board at University of California, Irvine. Provenance and peer review Not commissioned ; externally peer reviewed. Data availability statement No data are available. Open access This is an open access article distributed in accordance with the Creative Commons Attribution Non Commercial ( CC BY-NC 4. 0 ) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative","label":[[740,747,"MODEL"],[593,599,"TECHNIQUE"],[794,800,"METRIC"]],"Comments":[]}
