{"id":1,"text":"1 Park JI, BMJ Health Care Inform 2024 ; 31 : e100966. Open access Advancing equity in breast cancer care : natural language processing for analysing treatment outcomes in under-represented populations Jung In Park, 1 Jong Won Park, 2 Kexin Zhang, 3 Doyop Kim4 To cite : Park JI, Park JW, Zhang K, Advancing equity in breast cancer care : natural language processing for analysing treatment outcomes in under-represented populations. BMJ Health Care Inform 2024 ; 31 : e100966. bmjhci-2023-100966 Received 16 November 2023 Accepted 21 June 2024 1University of California Irvine, Irvine, California, USA 2Yonsei Cancer Center, Yonsei University College of Medicine, Seoul, South Korea 3Donald Bren School of Information & Computer Sciences, University of California Irvine, Irvine, California, USA 4Independent Researcher, Irvine, California, USA Correspondence to Dr Jung In Park ; junginp @ uci. edu Original research © Author ( s ) ( or their employer ( s ) ) 2024. Re-use permitted under CC BY-NC. No commercial re-use. See rights and permissions. Published by BMJ. ABSTRACT Objective The study aimed to develop natural language processing ( NLP ) algorithms to automate extracting patient-centred breast cancer treatment outcomes from clinical notes in electronic health records ( EHRs ), particularly for women from under-represented populations. Methods The study used clinical notes from 2010 to 2021 from a tertiary hospital in the USA. The notes were processed through various NLP techniques, including vectorisation methods ( term frequency-inverse document frequency ( TF-IDF ), Word2Vec, Doc2Vec ) and classification models ( support vector classification, K-nearest neighbours ( KNN ), random forest ( RF ) ). Feature selection and optimisation through random search and fivefold cross-validation were also conducted. Results The study annotated 100 out of 1000 clinical notes, using 970 notes to build the text corpus. TF-IDF and Doc2Vec combined with RF showed the highest performance, while Word2Vec was less effective. RF classifier demonstrated the best performance, although with lower recall rates","label":[[1699,1712,"MODEL"],[1590,1598,"MODEL"],[2007,2015,"MODEL"],[1692,1695,"MODEL"],[108,135,"TECHNIQUE"],[339,366,"TECHNIQUE"],[1115,1142,"TECHNIQUE"],[1723,1740,"TECHNIQUE"],[1793,1809,"TECHNIQUE"],[1766,1779,"TECHNIQUE"],[1512,1525,"TECHNIQUE"],[1580,1586,"TECHNIQUE"],[1933,1939,"TECHNIQUE"],[1145,1148,"TECHNIQUE"],[1486,1489,"TECHNIQUE"],[2105,2111,"METRIC"]],"Comments":[]}
