{"id":16,"text":"##J Health Care Inform 2024 ; 31 : e100966. Open access contained noise or outliers that affected the performance of the KNN model negatively. Our study has some limitations. Due to the small size of annotated notes, our approach has limited generalis-ability. We aim to collect more data and annotations to address this in the future work. Expanding our dataset will allow us to better validate our findings, refine our methodology and potentially increase the accuracy and robustness of our predictions. Additionally, we observed that document-level approaches, especially the deep learning-based Doc2Vec model, performed better than other methods in general. We plan to explore the possi-bility of using embeddings from large language models for text vectorisation to further improve performance. Overall, our study contributes to the field of clin-ical NLP by developing a high-performing pipeline for capturing invasive breast cancer treatment outcomes of women from under-represented populations. While the NLP methods we employed were not new in themselves, their application to our specific target demographic sets our work apart. We were able to access and interpret a wealth of nuanced, unstructured data that would other-wise have been difficult to investigate. We could identify potential disparities in care, offering valuable insights that can be used to develop strategies for achieving more equitable healthcare outcomes for these vulnerable groups. In addition, our findings provided insights into the importance of document-based text vectorisation and Receiver operating characteristic curves for text vectorisation and classification methods. AUC, area under the curve ; KNN, K-nearest neighbours ; RF, random forest ; SVC, support vector classification ; TF-IDF, term frequency-inverse document frequency. BMJ Health & Care Informatics : first published as 10. 1136 / bmjhci-2023-100966 on 1 July 2024. Downloaded from https : / / informatics. bmj. com on 11 April 2025 by guest. Protected by copyright, including for uses related to text and data mining, AI training, and similar technologies. 9 Park JI, BMJ Health Care Inform 2024 ; 31 : e100966. Open access the efficacy of ensemble methods in the context of clin-ical notes data. Furthermore, the pipeline we developed is adaptable and generalisable to other","label":[[1723,1736,"MODEL"],[579,592,"TECHNIQUE"],[584,592,"TECHNIQUE"],[1776,1782,"TECHNIQUE"],[462,470,"METRIC"],[1663,1666,"METRIC"]],"Comments":[]}
