{"id":4,"text":"is crucial for capturing information on comprehensive symptoms and side effects that patients experience, 14 as it can provide insights into monitoring and individualised symptom management. Several studies have investigated breast cancer treatment outcomes using clinical notes and NLP14 – 16 ; however, research that specifically aims the capture of treatment side effects and patient-reported outcomes in patients with breast cancer from under-represented popula-tions remains sparse. Addressing this research gap is important, because these populations face unique health disparities that impact treatment outcomes and patient care. Understanding these specific challenges and barriers enables the development of targeted inter-ventions to mitigate disparities and enhance health outcomes. There is a clear need for an automated tool to capture symptoms and side effects from clinical notes, enabling accurate symptom management and tailored nursing care planning for those patients from under-represented populations. The goal of this study was to develop NLP algorithms to automate the knowledge extraction process for patient-centred breast cancer treatment outcomes from clinical notes, aiming to gain valuable insights to improve care for those from under-represented populations. Specif-ically, we aimed to compare the effectiveness of these algorithms in providing scientific evidence for their use in the care of patients with breast cancer from under-represented populations. METHODS To harness the full potential of large health datasets from the EHRs and unique application of NLP techniques, we sourced EHR clinical notes dated 1 January 2010 to 31 August 2021 at a tertiary hospital in the USA, selecting patients who met the following criteria : women from under-represented populations ( Hispanic, Amer-ican Indian or Alaska Native, Asian, black or African-American, Native Hawaiian or Other Pacific Islander or multiple race ) ; aged 18 years or greater ; diag-nosed with invasive breast cancer ; had at least one follow-up visit at the medical centre after breast cancer treatment ( ie, surgery, radiation therapy, chemotherapy, endocrine therapy or hormone therapy ). We excluded the patients who were not followed up at the medical centre. Overview of the NLP pipeline In this study, we developed a classification model to predict a binary outcome : whether a side effect was observed in relation to breast cancer treatment, based on the text within a clinical note. Our approach involved a multistep process, as illustrated in The process began with raw clinical notes from which text was extracted to train and test the downstream models. The extracted texts underwent","label":[[141,151,"TECHNIQUE"],[1061,1064,"TECHNIQUE"],[1592,1595,"TECHNIQUE"],[2279,2282,"TECHNIQUE"],[1205,1209,"METRIC"],[480,486,"TECHNOLOGY"],[1844,1850,"TECHNOLOGY"]],"Comments":[]}
