{"id":4,"text":"shared tasks. 3. 1 Sentence similarity The sentence similarity task is to predict simi-larity scores based on sentence pairs. Following common practice, we evaluate similarity by using Pearson correlation coefficients. BIOSSES is a corpus of sentence pairs selected from the Biomedical Summarization Track Training Dataset in the biomedical do-main (, 2017 ). 1 To develop BIOSSES, five curators judged their similarity, us-ing scores that ranged from 0 ( no relation ) to 4 ( equivalent ). Here, we randomly select 80 % for training and 20 % for testing because there is no standard splits in the released data. MedSTS is a corpus of sentence pairs se-lected from Mayo Clinic ’ s clinical data ware-house ( Wang, 2018b ). To develop MedSTS, two medical experts graded the sentence ’ s seman-tic similarity scores from 0 to 5 ( low to high sim-ilarity ). We use the standard training and testing sets in the shared task. 3. 2 Named entity recognition The aim of the named entity recognition task is to predict mention spans given in the text ( Ju-rafsky and Martin, 2008 ). The results are evalu-ated through a comparison of the set of mention spans annotated within the document with the set of mention spans predicted by the model. We eval-uate the results by using the strict version of preci-sion, recall, and F1-score. For disjoint mentions, all spans also must be strictly correct. To construct the dataset, we used spaCy2 to split the text into a sequence of tokens when the original datasets do not provide such information. BC5CDR is a collection of 1, 500 PubMed titles and abstracts selected from the CTD-Pfizer cor-pus and was used in the BioCreative V chemical-disease relation task ( Li, 2016 ). 3 The dis-eases and chemicals mentioned in the articles were annotated independently by two human experts with medical training and curation experience. We use the standard training and test set in the 1http : / / tabilab. cmpe. boun. edu. tr / BIOSSES / 2https : / / spacy. io / 3https","label":[[1302,1308,"METRIC"],[1314,1322,"METRIC"],[286,299,"APPLICATION"],[1566,1572,"DATASET"],[1978,1983,"TECHNOLOGY"]],"Comments":[]}
