{"id":2,"text":"##unology Project Consortium ( HIPC ) is a multicenter collaboration aimed at performing large studies to profile human immune response to natural in-fection and vaccination. Each center submits their data to the Immunology Database and Analysis Portal ( Imm-Port ), the primary resource funded by NIH NIAID DAIT to capture such human immunology studies. As part of the HIPC data standards committee, we are work-ing towards harmonizing how data from different centers are represented that describe cell sorting strategies and frequencies of cell populations. We examined studies de-posited into ImmPort in the past, focusing on the two fields that describe 1 ) the cell population targeted, which contains the human language name of the cell type the re-searcher was studying ( e. g. \" activated B cell \" ) and 2 ) the gating strategy applied, which specifies what markers were being used to identify cells of that type ( e. g. \" intact / lymphocyte / CD3− / CD14− / CD19 + / CD38 + \" ). These two fields in ImmPort are not meant to provide a fully repro-ducible description of how experiments were conducted, © The Author ( s ). 2019 Open Access This article is distributed under the terms of the Creative Commons Attribution 4. 0 International License ( http : / / creativecommons. org / licenses / by / 4. 0 / ), which permits unrestricted use, distribution, and reproduction in any medium, provided you give appropriate credit to the original author ( s ) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The Creative Commons Public Domain Dedication waiver ( http : / / creativecommons. org / publicdomain / zero / 1. 0 / ) applies to the data made available in this article, unless otherwise stated. * Correspondence : bpeters @ lji. org 2Division for Vaccine Discovery, La Jolla Institute for Allergy and Immunology, La Jolla, CA, USA 8Department of Medicine, University of California San Diego, La Jolla, CA, USA Full list of author information is available at the end of the article Overton BMC Bioinformatics 2019, 20 ( Suppl 5 ) : 182 https : / / doi. org","label":[],"Comments":[]}
