{"id":1,"text":"RESEARCH Open Access Reporting and connecting cell type names and gating definitions through ontologies James A. Overton1, Randi Vita2, Patrick Dunn3, Julie G. Burel2, Syed Ahmad Chan Bukhari4, Kei-Hoi Cheung5, Steven H. Kleinstein4, 6, Alexander D. Diehl7 and Bjoern Peters2, 8 * From Second International Workshop on Cells in ExperimentaL Life Sciences Corvallis, OR, USA. 7 August 2018 Abstract Background : Human immunology studies often rely on the isolation and quantification of cell populations from an input sample based on flow cytometry and related techniques. Such techniques classify cells into populations based on the detection of a pattern of markers. The description of the cell populations targeted in such experiments typically have two complementary components : the description of the cell type targeted ( e. g. ‘ T cells ’ ), and the description of the marker pattern utilized ( e. g. CD14−, CD3 + ). Results : We here describe our attempts to use ontologies to cross-compare cell types and marker patterns ( also referred to as gating definitions ). We used a large set of such gating definitions and corresponding cell types submitted by different investigators into ImmPort, a central database for immunology studies, to examine the ability to parse gating definitions using terms from the Protein Ontology ( PRO ) and cell type descriptions, using the Cell Ontology ( CL ). We then used logical axioms from CL to detect discrepancies between the two. Conclusions : We suggest adoption of our proposed format for describing gating and cell type definitions to make comparisons easier. We also suggest a number of new terms to describe gating definitions in flow cytometry that are not based on molecular markers captured in PRO, but on forward-and side-scatter of light during data acquisition, which is more appropriate to capture in the Ontology for Biomedical Investigations ( OBI ). Finally, our approach results in suggestions on what logical axioms and new cell types could be considered for addition to the Cell Ontology. Keywords : Cell type, Standards, Gating definitions, Human immunology project consortium, Immunology database and analysis portal protein ontology, Cell ontology, HIPC, ImmPort Background The Human Imm","label":[[633,642,"TECHNOLOGY"]],"Comments":[]}
