{"id":4,"text":"\". While it was mostly possible to re-construct center-specific conventions for separat-ing gates given the large volume of data we had to work on, a general convention on how to separate gates should be agreed upon to avoid ambiguity. Based on our inspection of potential clashes with characters contained in protein names and other markers, we suggest using commas as separators, which were not part of any marker names we encountered, and that rarely occur in generalized names for markers in the Protein Ontology ( PRO ). To allow for the ( unusual ) case of specifying marker names that contain a comma, the marker name should be contained within double quotes. Synonyms Most individual gates name a marker that is detected, typically a protein. The Protein Ontology ( PRO ) contains a comprehensive list of protein names and accurate syn-onyms, such as the CD nomenclature which identifies \" CD279 \" as a synonym of \" PDCD1 \". While a large num-ber of gates could be parsed using the existing PRO no-menclature, we also identified a number of cases where markers were labeled differently than the official labels or exact synonyms in PRO, for example, different capitalization and the presence or absence of hyphens for \" KI-67 \" ( \" Ki-67 \", \" Ki67 \", \" ki67 \" ) or \" PD1 \" instead of \" PDCD1 \". lists examples of proposed new syno-nyms to be submitted to PRO for consideration as exact synonyms used by the immunology community. Fre-quently, the proposed new marker labels are lacking hy-phens, which are easily confused with the marker being ‘ negative ’, and thus tend to be avoided when describing markers for flow cytometry. We suggest submitting syn-onyms to PRO rather than maintaining a separate list for our purposes to recognize PRO as the central arbiter and translator of protein names and synonyms that are themselves based on UniProt standardized names, which will be useful also in other contexts outside of flow cytometry. Protein subunits vs complexes While the synonyms in were considered not problematic, we also found a number of labels that could not be mapped precisely to individual proteins in PRO. A common case were protein complexes : Investigators","label":[],"Comments":[]}
