{"id":7,"text":"CD8 A protein complex that serves as a T cell co-receptor consisting of either an alpha-beta heterodimer, or an alpha-alpha homodimer Use PRO term for CD8 protein complex : PR : 000025402. Work with PRO to include alpha / alpha and alpha / beta complexes, and update logical definitions CD3 The invariant subunit of the T cell receptor complex, consisting of multiple chains including CD3E Use PRO term for CD3E chain : PR : 000001020. Work with PRO to define CD3 complex. HLA-DR An MHC protein complex consisting of alpha and beta chains encoded in the DR locus. Use PRO term for DR beta chain ( PR : 000036952 ). Work with PRO to define the different complexes pSTAT1 pSTAT3 pSTAT5 STAT1 / 3 / 5 proteins that have been phosphorylated. Utilize terms in PRO for phosphorylated forms of proteins ( e. g. PR : 000003075 for STAT1 ), and work with PRO to ask if these can be included as synonyms. LIN A mixture of lineage markers, typically used to exclude major lineages of cells in blood T cells, B cells, Monocytes, and NK cells, for example : CD3, CD14, CD16, CD19, CD20, CD56. Disallow this, and ask users to spell out what specific cocktail was used. Marker intensities and their preferred labels Marker state Preferred label Alternative labels Negative – neg Positive + Pos Low + − dim, lo Intermediate + ~ int, medium, med High + + bright, hi Overton BMC Bioinformatics 2019, 20 ( Suppl 5 ) : 182 Page 261 of 264 alpha-beta T cell ’ & \" Temra \". As a result, the current data set was manually mapped to CL terms. Detecting clashes between population names and gating definitions The gating and cell population definitions we are pro-posing express semantics that go beyond simple string labels. Each marker, marker intensity, and cell type is an ontology term, embedded in a network of links to other ontology terms, and to data using those terms. The Cell Ontology uses the Web Ontology Language ( OWL ) to provide logical axi","label":[[14,21,"MODEL"],[163,170,"MODEL"],[245,254,"MODEL"],[336,343,"MODEL"],[464,471,"MODEL"],[495,502,"MODEL"],[653,662,"MODEL"]],"Comments":[]}
