{"id":8,"text":"##oms for characteristic markers and their expression levels for a given cell type. For example, ‘ effector memory CD4-positive, alpha-beta T cell ’ is de-fined as equivalent to \" CD4-positive, alpha-beta memory T cell and lacks _ plasma _ membrane _ part some receptor-type tyrosine-protein phosphatase C isoform CD45RA and lacks _ plasma _ membrane _ part some C-C chemokine receptor type 7 and lacks _ plasma _ membra-ne _ part some interleukin-2 receptor subunit alpha \", link-ing to the Protein Ontology and the Relation Ontology. These restrictions on the markers known to be present or absent on a specific cell type can be com-pared to the actual gating strategy used, in order to de-tect discrepancies that could identify potential errors in data entry, or disagreements how cell types should be defined in terms of markers in the Cell Ontology. In order to detect such discrepancies, we implemented a prototype validator, shown in which can be accessed through https : / / github. com / jamesaoverton / cell-name-and-marker-validator. The proposed workflow is that users would input \" Population name \" and \" Gating definitions \" fields and the validator will check both for validity and cross-check for consistency. This validator can be used to ensure that only valid data is entered into future ImmPort submissions and can also identify dis-crepancies between the logical definition in the Cell Ontology and what the user is entering. For example, a cell population name and the gating definition conflict, as would happen if the population name was \" CD4-posi-tive, alpha-beta T cell \" and the gating definition was en-tered as \" CD4−CD19 + CD20−CD27 + + CD38 + − \" with the conflict being that CD4-positive, alpha-beta T cell are defined as being CD4 molecule positive. In this case, the error is due to the submitted data, but in-consistencies in CL could also be identified, such as the need to define TEMRA cells ( a shorthand of TEM cells re-expressing CD45RA ) as a distinct sib-ling of TEM cells ( which are logically defined as not expressing","label":[],"Comments":[]}
