{"id":5,"text":"often refer to \" CD8 \", which is a complex of a CD8 alpha and beta-chain, or a complex of two CD8 alpha chains. Unless otherwise specified, gating for CD8 + cells is com-monly done by staining for the CD8 alpha chain ( CD8A ). Similarly, \" CD3 \" usually refers to the invariant subunit of the T cell receptor complex, CD3 epsilon ( CD3e ), whereas the TCR complex consists of multiple chains. lists these cases which we consider to be more problematic. Ideally, all of these protein complexes would be included in PRO, and described in terms of Examples of alternative labels for protein markers commonly used in flow cytometry that will be submitted to PRO Preferred label in PRO Alternative label for Flow Cytometry BDCA-2 BDCA2 KLRB1 CD161 MKI67 KI67 PDCD1 PD1 TNF-a TNFa Overton BMC Bioinformatics 2019, 20 ( Suppl 5 ) : 182 Page 260 of 264 their component chains where possible, but this is not currently universally available. This work should be co-ordinated with the Cell Ontology, to ensure it matches the logical cell type definitions. Other markers Other examples of proteins that could not easily be mapped are phosphorylated proteins, of which we only encountered three ( pSTAT1, 3 and 5 ), but this and other post-translational modifications of proteins should be handled in a generalizable fashion. Finally, the use of cocktails of markers to include or exclude lineages of cells ( e. g. ‘ Lin-’ ) is hard to represent as different cocktails exist, so it would be preferable to spell out what exactly the markers are that are being utilized in a given experi-ment. lists these cases and our current approach to handling them, as well as longer term plans on how to handle them in the future, which will require coordination across several ontology development efforts. Marker intensities The vast majority of gating definitions consider only positive vs. negative marker patterns, but how they are expressed was variable. lists the different marker states we encountered, how they were labeled, and what the preferred label should be going forward. For example, marker negative gating strategies were indi-cated by adding \"-\", \" negative \", or","label":[[35,42,"MODEL"],[79,86,"MODEL"],[309,316,"MODEL"],[356,363,"MODEL"],[140,146,"TECHNOLOGY"]],"Comments":[]}
