{"id":3,"text":"/ 10. 1186 / s12859-019-2725-5 which is captured in other standards such as MIFlowCyt or Gating-ML, but rather are intended to re-flect how immunologists typically describe targeted cell populations in journal articles and allow one to query for experiments in which cell populations of interest were studied. An initial examination of the data submitted to Imm-Port revealed that, in the absence of precise standards on how these fields should be populated, users have chosen different approaches to populate them. While these are mostly understandable to human experts, they are hard or impossible to parse computationally. Without such parsing, it is not possible to formulate precise queries to identify and cross-compare cell populations from studies across HIPC or ImmPort. We describe here our attempts to standardize the \" cell population \" field, by mapping it to terms in the Cell Ontology while allowing for add-itional subset information, and mapping the \" gating strat-egy \" field to the Protein Ontology where specific protein markers are utilized. Thus, we hope to standardize how these data are captured utilizing ontology terms. As a result of this work, we propose a new convention on how these two fields should be populated that allows one to in-terpret them computationally, query across them, and to utilize logical axioms in the Cell Ontology to check for consistency between them. Methods and results Parsing the gating definitions field Separators The gating definitions we extracted from ImmPort typic-ally consisted of a list of markers alongside a classifica-tion specifying if presence of the marker was detected or not ( and in some cases, how strongly ), with separator characters such as whitespaces, commas, semicolons, slashes, colons, or any combination thereof being used to distinguish between individual gates. Gating defini-tions submitted by the same center typically followed the same conventions for separation. We thus imple-mented center-specific code to split the gating definition into a series of individual gates. For example, \" singlet / CD14− / CD3 + \" is a gating definition from a center using slashes as separators which consists of three gates : \" sing-let \", \" CD14− \", and \" CD3 +","label":[],"Comments":[]}
