{"id":1,"text":"Medical & Biological Engineering & Computing 63 : 749 – 772 https : / / doi. org / 10. 1007 / s11517-024-03227-4 ORIGINAL ARTICLE NSSC : a neuro-symbolic AI system for enhancing accuracy of named entity recognition and linking from oncologic clinical notes Álvaro García-Barragán1 · Ahmad Sakor2, 3 · Maria-Esther Vidal2, 3 · Ernestina Menasalvas1 · Juan Cristobal Sanchez Gonzalez4 · Mariano Provencio4 · Víctor Robles1 Received : 31 May 2024 / Accepted : 12 October 2024 / Published online : 1 November 2024 © The Author ( s ) 2024 Abstract Accurate recognition and linking of oncologic entities in clinical notes is essential for extracting insights across cancer research, patient care, clinical decision-making, and treatment optimization. We present the Neuro-Symbolic System for Cancer ( NSSC ), a hybrid AI framework that integrates neurosymbolic methods with named entity recognition ( NER ) and entity linking ( EL ) to transform unstructured clinical notes into structured terms using medical vocabularies, with the Unified Medical Language System ( UMLS ) as a case study. NSSC was evaluated on a dataset of clinical notes from breast cancer patients, demonstrating significant improvements in the accuracy of both entity recognition and linking compared to state-of-the-art models. Specifically, NSSC achieved a 33 % improvement over BioFalcon and a 58 % improvement over scispaCy. By combining large language models ( LLMs ) with symbolic reasoning, NSSC improves the recognition and interoperability of oncologic entities, enabling seamless integration with existing biomedical knowledge. This approach marks a significant advancement in extracting meaningful information from clinical narratives, offering promising applications in cancer research and personalized patient care. Keywords Neuro-symbolic · LLM · NER · EL · EHR · Breast cancer 1 Introduction Cancer remains a major public health problem, ranking as the second leading cause of death worldwide. In particular, breast cancer is the most common cancer in women world-wide and the second most common cancer in general. According to the","label":[[1408,1429,"MODEL"],[930,939,"MODEL"],[1385,1393,"MODEL"],[1821,1824,"MODEL"],[905,919,"TECHNIQUE"],[895,898,"TECHNIQUE"],[1827,1830,"TECHNIQUE"],[178,186,"METRIC"],[1210,1218,"METRIC"],[1919,1926,"APPLICATION"]],"Comments":[]}
