{"id":16,"text":"is a set of candidate medical terms in UMLS. The MEL component resorts to a symbolic background knowledge ( BK ) to identify the potential terms from UMLS asso-ciated with e. The BK is built on top of the UMLS and represents medical terms using factual statements that associate the term with labels and semantic types. Since for the same medical term, different organizations may have assigned different labels to the term, BK keeps track of the number of duplicate labels and ranks the labels per term based on this number ; we call this number the linking score of the labels of a term. Given an entity e, the MEL component searches on BK, the potential terms from UMLS that will be part of te. To increase confidence in the correctness of the terms in te, the MEL component follows a heuristic-based approach, which assumes that the labels with the highest values of the linking score are the most appropriate labels for e. Following tech-I Context-based labels Hybrid AI design : hybrid design to recognize medical entities and their corresponding terms in medical controlled vocabulary such as UMLS 123 Medical & Biological Engineering & Computing 63 : 749 – 772 757 NSSC configurable parameters Parameter Description qtype Specifies the format of the query to be executed against the BK to obtain the candidates concepts θsim Threshold of the value of the similarity measure of the filtering module pLLM The type of prompt used to query the LLM to disambiguation candidates niques proposed by Sakor, the MEL component indexes e and extends it with their synonyms. A BM25 † algorithm is executed on the BK for querying and ranking entities in I based on linking score, including label, semantic type, score, and definition in each index. As a result, for each entity e in I, a set te of the top k candidates for links in UMLS is generated. Medical entity disambiguation ( MED ) component : Symbolic background knowledge is used for prompt engineering, and a set of prompts is generated to query a large language model ( LLM ) whose responses allow the disambiguation of the medical terms associated with each recognized entity. The generated prompts aim to maxi-mize the efficiency of the large language","label":[[2003,2023,"MODEL"],[1448,1451,"MODEL"],[2026,2029,"MODEL"],[1846,1875,"TECHNIQUE"],[1938,1956,"TECHNIQUE"],[1629,1636,"APPLICATION"]],"Comments":[]}
