{"id":29,"text":"##s Cancer concept 25 29 Cancer type 18 19 Cancer subtype 19 34 Cancer expansion 14 18 Cancer location 151 333 Surgery 69 138 Treatment drug 96 103 Treatment name 46 68 Total 438 742 Rtop-N includes the top N responses in the system ’ s out-put. Execution time corresponds to the elapsed time spent to execute an NLP tool to solve the problem of oncologic entity linking in the entire benchmark. The execution time is mea-sured using the Python library time. It is acknowledged that the timing of a general-purpose computer is influenced by the operating system scheduler. As a result, the reported times represent an average of five different runs conducted at various times. Finally, the metric tokens (. ) quantifies the number of tokens generated by an LLM. In our experiments, tokens (. ) is calculated using the OpenAI API. Baselines The following NLP tools are considered as base-lines : scispaCy is a specialized approach designed for processing biomedical and scientific texts, based on the spaCy library ’ s robust framework. It specifically addresses the complex requirements of biomedical infor-mation, providing an extensive array of tools and models designed for functions like named entity recognition, dis-ambiguation, among others. BioFalcon is an entity recognition and linking engine. It extends the background knowledge and the target KG of the Falcon approach from DBpedia and Wikidata to UMLS to support entity linking to UMLS. BioFalcon effectively maps entities and relations within a short text to its mentions of a background knowledge graph. It overcomes the challenges of short text using a light-weight linguistic approach based on a background knowledge graph. Annotations with breast cancer information 123 Medical & Biological Engineering & Computing 63 : 749 – 772 765 NSSC has three configurable parameters ( see that must to be set appropriately. To achieve this, we present abla-tion studies described in Section5. 1, where we tune each moduleseparatelyinasequentialsearchspace. Sincetheterm must be among the candidates selected by the LLM, the link-ing part must be optimized to present the correct candidates. Then, we compared NSSC with the parameters selected in the ablation study with the base","label":[[895,903,"MODEL"],[1066,1073,"MODEL"],[818,824,"MODEL"],[1365,1371,"MODEL"],[757,760,"MODEL"],[2073,2076,"MODEL"],[356,370,"TECHNIQUE"],[1426,1440,"TECHNIQUE"],[882,886,"TECHNIQUE"],[2232,2236,"TECHNIQUE"],[313,316,"TECHNIQUE"],[854,857,"TECHNIQUE"],[1000,1005,"TECHNOLOGY"],[825,828,"TECHNOLOGY"]],"Comments":[]}
