{"id":18,"text":"##sim, and a prompt pLLM to disambiguate concepts. Each parameter is described in The NSSC background knowledge ( BK ) has four special-ized modules categorized by article : Domain knowledge and ontology – Indexer stores and indexes vocabulary medical terms for retrieval. – Semantic information is used to store domain external information to make decisions about the disambigua-tion process. Trained models – Clinical NER corresponds to the trained model in the breast cancer domain for clinical entity recognition. – LLM : a generic model which is responsible for dis-ambiguating candidates. NSSC is presented in Section4. 1, which describes how a free text flow through the whole system. Each of the three components of our NSSC system is explained separately, entity recognition in Section4. 2, entity linking in Section4. 3, and entity disambiguation in Section4. 4. Finally, the algo-rithm complexity is discussed in Section4. 5. 4. 1 NSSC flowchart After training the models and configuring all parameters, NSCC normalizes new Spanish free text and extracts the cor-123 758 Medical & Biological Engineering & Computing 63 : 749 – 772 responding CUIs. This online process is illustrated in NSSC receives T, an oncologic clinical note which is initially passed to the NER module to obtain a set of entities I, each represented as a tuple ( e, le ). Subsequently, for each entity in I, the medical entity linking module consults the BK using rule-based heuristics to make a decision. This decision deter-mines whether we have an acceptable term t for an entity e, do not have it, or do not need to disambiguate. If disambigua-tion is required, the medical entity disambiguation module creates a prompt pLLM with the medical entity e, each label le, the candidate terms te, and their corresponding UMLS definitions. Ultimately, NSSC either successfully selects the best terms, finds them inadequate, or provides a translation of the term. If the term is translated, it is searched again, and the process is repeated. For instance, given an input T, \" Paciente diagnosti-cado con car","label":[[520,523,"MODEL"],[1653,1682,"TECHNIQUE"],[800,814,"TECHNIQUE"],[1403,1417,"TECHNIQUE"],[420,423,"TECHNIQUE"],[1274,1277,"TECHNIQUE"]],"Comments":[]}
