{"id":30,"text":"##lines in Section5. 2. 5. 1 Ablation studies This section details the process of configuring various com-ponents of NSSC. The initial results related to the NER model are described in. Subsequently, our focus shifts exclusively to the entity linking aspect. Ablation studies are performed to distinguish the collaborative and independent functionalities of medical entity linkage and medical disam-biguation. In systems with a constrained number of modules, each equipped with its unique configuration parameters, the parameter search process becomes crucial. In our specific context, where modules operate autonomously, we advo-cate a strategic approach to parameter search. The primary purpose of each module is to optimize the accuracy of the candidates it presents. In simpler terms, each module should return the most accurate and relevant candidates, prioritiz-ing their ranking within the top selections. We address RQ1 by presenting a comparative analysis in To config-ure the entity linking module, we have tested five different querying methods, each with an increasingly wide range of search results : 1. Exact : This method is strictly exact match. Only results that exactly match the query terms in the knowledge base are returned. 2. Basic _ fuzzy : This method uses basic fuzzy matching, allowing for slight variations in the query terms. 3. Multi _ match _ SPA : This query method represents the highest level of fuzziness and targets Spanish terms. 4. Multi _ match : The same level of fuzziness is as Multi _ match _ SPA, but can also return terms from any language. 5. Multi _ match _ boosted : This query method can return results in any language and boosted terms related to can-cer which are prioritized in the search results, that is, if the term cancer appears in the term candidate, it has a higher score. The metrics used for comparison are the following : Accuracy @ 1 ( % ) : This represents the accuracy in retriev-ing the best-fit term from the BK. For instance, the Multi _ match _ boosted method has an accuracy of 54. 02 %, indicating that in 54. 02 % of the cases, the top term retrieved was the correct one. Accuracy @ 15 ( % ) : This measures the accuracy when retrieving a broader set of terms,","label":[[236,250,"TECHNIQUE"],[986,1000,"TECHNIQUE"],[1149,1160,"TECHNIQUE"],[1227,1231,"TECHNIQUE"],[158,161,"TECHNIQUE"],[731,739,"METRIC"],[1884,1892,"METRIC"],[1925,1933,"METRIC"],[2036,2044,"METRIC"],[2144,2152,"METRIC"],[2184,2192,"METRIC"],[878,885,"APPLICATION"]],"Comments":[]}
