{"id":17,"text":"model while minimizing the cost of using the model. The MED com-ponent receives triples ( e, le, te ) and generates the set h corresponding to a solution of the optimization specified in Eq. 1. This component uses the predictive capabili-ties of LLMs and the reasoning process performed over BK to identify for each e and a singleton set te. The model captures the broader context surrounding the iden-tified oncologic entities ( provided as input ), ensuring a holistic understanding of the entities and their interac-tion within the clinical notes, as well as the contextual information of the entity encoded in the BK. The med-ical entity linking process facilitates the extraction of CUIs based on the context and semantics of the iden-tified entities, improving interoperability, consistency, and semantic alignment. This contextual information-collected from the background knowledge-is exploited for performing a Chain of Thought ( CoT ) for engi-neering the prompts posed over the LLM. 4 The NSSC algorithms This section introduces the algorithms that implement NSSC, focusing on how they integrate symbolic reasoning with advanced language models to address the complexities of oncologic entity linking. By using a background knowledge base and a modular design, NSSC effectively handles the variations in medical terminology and context that are preva-lent in clinical narratives. This ensures that terms such as \" mama derecha \" from the vocabulary are correctly recog-nized even when expressed differently, such as \" mama parte derecha, \" inclinicalnotes. Theinitialsearchgeneratesasetof potential candidate matches. The algorithm then uses heuris-tics to determine whether these candidate terms should be passed on to an LLM for a more fine-grained disambiguation process. Actually, this mimics the process a human would use to associate a Spanish term with a medical vocabulary : 1. Recognize an entity in the text. 2. Search for the entity without any modifications. 3. Search for similar terms in the list of candidates. 4. If not found, translate the entity into English and perform the search again. NSSC has three configurable parameters : the query type qtype, a threshold of the symbolic module θ","label":[[989,992,"MODEL"],[1734,1737,"MODEL"],[920,936,"TECHNIQUE"],[635,649,"TECHNIQUE"],[1197,1211,"TECHNIQUE"],[1245,1249,"TECHNIQUE"]],"Comments":[]}
