{"id":15,"text":"##ction quantifying cost of processing the tasks of recognizing e and linking e to t γ (. ) Function that assigns a short medical note T to a set of medical entities I te Set of candidate medical terms for the medical entity e le Label representing the context of an entity e in medical note 123 756 Medical & Biological Engineering & Computing 63 : 749 – 772 entities, a rule-based system guided by symbolic background knowledge, and a large language model to solve the optimiza-tion problem in Eq. 1. The modular design pattern in illustrates the usage of a hybrid AI system that combines these three AI sub-systems. This compositional design pattern is based on the basic design patterns proposed by van Bekkum to describe hybrid AI systems. Thus, NSSC comprises the following components : Named entity recognition ( NER ) component : This component aims to identify oncologic entities within clinical text. Medical entities are recognized from med-ical notes based on a BERT-based language model pre-trained with oncologic terms from clinical notes. The NER component receives a clinical note T and produces a set of medical entities I ; for each recognized entity e in I, it assigns a label le representing its context in the clinical note. This annotation is captured in the function γ (. ) in a way that γ ( T ) = I. Using a BERT-based NER procedure, the NER component systematically analyzes unstructured clinical notes in T to recognize relevant entities such as tumor types, treatment modalities, and relevant clinical concepts. This task of entity recognition task includes a contextual analysis mechanism to capture the broader context surrounding the identified oncologic entities. Contextual information is crucial for the dis-ambiguation of entities. The NER component trains a model on a diverse dataset of clinical notes, ensuring the accurate extraction of entities along with their contextual information. The process to train this model is described in detail by García-Barragán. Medical entity linking ( MEL ) component : A rule-based model is utilized to link medical entities to a list of candidate medical terms ; a symbolic background knowledge serves as an extensional database to deduce candidate links. The MEL component receives the set I of medical entities recognized by the NER component andgeneratesasetofpairs ( e, te ) wheree belongstoI and te","label":[[437,457,"MODEL"],[974,984,"MODEL"],[1332,1336,"MODEL"],[2008,2022,"TECHNIQUE"],[820,823,"TECHNIQUE"],[1058,1061,"TECHNIQUE"],[1343,1346,"TECHNIQUE"],[1362,1365,"TECHNIQUE"],[1770,1773,"TECHNIQUE"],[2306,2309,"TECHNIQUE"]],"Comments":[]}
