{"id":22,"text":") = 1 then 22 : Add tuple ( e, t ′ e ) to h 23 : else 24 : Disambiguate ( e, le, t ′ e ) 25 : end if 26 : end for 27 : end procedure The choice of query type is another customizable param-eter within our system. Queries can be Exact, Basic _ Fuzzy, Multi _ match _ SPA, Multi _ match, andMulti _ match _ boosted. Details in Section5. 1. 4. 3. 1 Filtering The results of searching in the knowledge base can be large. As we know, optimizing the number of tokens sent to an LLM is crucial for several reasons related to efficiency, computa-tional cost, and model limitations. In particular, 1. Response time : Smaller inputs typically result in faster response times, which is critical for applications that require real-time or near real-time interactions. 2. Model output constraints : Some models have constraints onthemaximumlengthofgeneratedresponses, andsend-ing fewer tokens ensures that the response fits within those constraints. 3. Noise reduction : Sending extraneous or irrelevant tokens to the model can introduce noise and potentially affect the quality of the generated output. 4. Mitigate model bias : Expanded inputs can weaken the influenceofessentialdetails, potentiallyleadingtobiased or less accurate results. As a consequence, our approach includes an optimization stepinwhichthesearchresultsaregroupedbycui andranked with a matching function. We propose to use a similarity function s (.,. ) that, when given a term of the candidate set ( result of a search query in the search engine, te ), returns a numeric value in the range of 0 to 1. Then, a threshold is defined so that only those candidates above the threshold are included in the final set of filtered candidates. This matching function is implemented in the Python documentation. 4 s : I J NSSC uses a threshold θsim that varies with context and requires configuration. The choice of this threshold for our case study is described in detail in Heuristic decision At this stage, three different scenarios can unfold : ( i ) there are no candidates are in the set, indicating that","label":[[939,954,"TECHNIQUE"]],"Comments":[]}
