{"id":33,"text":"its competitors. In stark contrast, the scispaCy models demonstrate exceptional effi-Comparison of GPT-3. 5 Turbo and GPT-4 performance with different prompt types over NSSC EL + LLM Prompt type Accuracy # Tokens Costs ( $ ) GPT-3. 5 Turbo Zero Shot – – – Few Shot 0. 4423 82, 329 0. 12 CoT 0. 7508 318, 862 0. 49 GPT-4 Zero Shot – – – Few Shot 0. 8512 289, 538 8. 80 CoT 0. 8834 350, 144 11. 46 The cost and tokens are calculated with OpenAI API ciency, with en _ core _ sci _ sm and en _ core _ sci _ lg models completing tasks in approximately 3. 65 and 3. 72s, respec-tively, and the en _ core _ sci _ scibert variant in 12. 98s. BioFal-con also reports an execution time of 154. 33s for the whole dataset. 6 Discussion The architecture of NSSC, as compared to other approaches in is a cancer domain-specific model designed to link terms to a biomedical vocabulary such as UMLS. Since UMLS comprises various vocabularies, NSSC is agnostic to the specific vocabulary being used. Other approaches focus on specific tasks such as NER or EL, while NSSC presents a complete pipeline that transforms clinical note free text into various vocabulary concepts. Other methods, such as those proposed in, use BERT embeddings to calculate the similarity between terms and entities. However, NSSC uses the BM25 algorithm as other approaches, which is faster, more efficient, and does not require any training data. However, this approach to disambiguate candidates requires the use of LLMs, which involves crafting prompts and results in increased memory and processing time. NSSCsolvestheoncology-medicinelinkingproblemwith the highest accuracy. However, the execution time increases by almost three orders of magnitude compared to the smallest version of scispaCy. Despite the higher computational cost, one of the NSSC strengths lies in its potential to general","label":[[1202,1206,"MODEL"],[606,613,"MODEL"],[99,102,"MODEL"],[118,121,"MODEL"],[225,228,"MODEL"],[314,317,"MODEL"],[99,104,"MODEL"],[225,230,"MODEL"],[40,48,"MODEL"],[1748,1756,"MODEL"],[1031,1034,"TECHNIQUE"],[195,203,"METRIC"],[1628,1636,"METRIC"],[436,446,"TECHNOLOGY"]],"Comments":[]}
