{"id":3,"text":"NER, NORM, and CODING. The state-of-the-art NLP tools scispaCy and Bio-Falcon are designed to recognize medical entities and associate them with terms in controlled vocabularies ( e. g., UMLS )-as illustrated in However, these tools often overlook contextual information and rely solely on string similarity. Furthermore, while they can be applied to Span-ish notes, there is no specific Spanish version of these tools. In conclusion, the complexity of extracting valuable infor-mation from EHRs, especially in oncology, poses significant challenges due to the nature of clinical language. Existing approaches, especially in Spanish, either focus on isolated tasks such as entity recognition or do not implement entity linking or information structuring. In addition, state-of-the-art tools such as scispaCy and BioFalcon, while effective in English, lack tailored versions for Spanish clinical notes and rely primarily on string similarity. Problem statement We address the problem of oncologic entity linking from medical notes, which involves accurately recognizing oncologic entities within the text and linking them to their corresponding terms in medical vocabularies. Proposed solution We present a novel approach called the NeuroSymbolic System for Cancer ( NSSC ), a hybrid AI framework specifically designed to extract and organize oncology terms from clinical narratives. NSSC processes free-text clinical documents written in a narrative format, automatically identifies all relevant medical entities, and links them to the appropriate terms in the Unified Medical Language System ( UMLS ). To the best of our knowledge, NSSC is the first system capable of automatically structuring information from oncology clinical narratives, specifically for breast cancer, in Spanish. Our approach integrates symbolic reasoning with lan-guage models to effectively recognize oncologic entities and link them to UMLS2 based on real breast cancer clinical notes. First, language models such as BERT are used to exploit the contextual knowledge encoded in clinical notes during the NER step. This first step is already addressed in. Next, a symbolic system is able to reason over a background knowledge that encodes relationships between medical concepts and their labels and semantic types in UML","label":[[54,62,"MODEL"],[799,807,"MODEL"],[71,77,"MODEL"],[1993,1997,"MODEL"],[712,726,"TECHNIQUE"],[996,1010,"TECHNIQUE"],[44,47,"TECHNIQUE"],[0,3,"TECHNIQUE"],[2080,2083,"TECHNIQUE"]],"Comments":[]}
