{"id":4,"text":"##S. Finally, large language models ( LLMs ) such as GPT-4 are used for their advanced natural language understanding capabilities. These models assist in disambiguating the most 2 https : / / www. nlm. nih. gov / research / umls appropriate UMLS term ( s ) by evaluating and interpreting the context around each recognized medical entity, thereby selecting the most relevant term from a number of potential options. We have conducted extensive validation experiments to assess the NSSC effectiveness. We have developed an in-house benchmark to compare NSSC with existing approaches. The validation process includes rigorous eval-uation metrics to demonstrate the robustness and reliability of NSSC in handling different clinical scenarios. Our work makes several significant contributions to the field of clinical natural language processing, particularly in the area of oncology : First integrated system for Spanish-specific clinical narratives : We present the first fully integrated system for extracting, linking, and structuring oncologic entities from Spanish-language clinical narratives. In doing so, we address the significant gap in the availability of NLP tools for Spanish medical texts. Generalizable and cost-effective system : Our approach is designed to be adaptable beyond breast cancer, making it versatile for other types of cancer and potentially other medical conditions. It is also cost-effective because it does not rely on resource-intensive pre-labeling of data. Novel disambiguation method based on LLMs : We propose a novel disambiguation method that exploits the capabilities of LLMs, such as GPT-4. This approach goes beyond traditional string similarity methods by using the contextual understanding power of LLMs to accurately identify and link the most appropriate UMLS terms, even in cases of ambiguous or complex medical terminology. The rest of the paper is organized as follows : Section2 summarizes the state of the art, and Section3 presents the addressed problem and our proposed solution based on a hybrid AI system. Next, the NSSC algorithms are described in Section4, and the results of the empirical evaluation are reported in Section5. We discuss the observed results in Sec-tion6, then the limitations are described in Section7, and finally, we conclude with the conclusions in Section8. 2 Related work Recent advances in hybrid AI systems have demonstrated significant improvements in various","label":[[53,56,"MODEL"],[1623,1626,"MODEL"],[1841,1848,"MODEL"],[532,541,"TECHNIQUE"],[2059,2063,"ARCHITECTURE"]],"Comments":[]}
