{"id":27,"text":"correspond to the category of clinical judge-ment. The corpus has been annotated following the process described in resulting in a total of 17, 986 entities. reports on the labels that have been used in the annotation process, their support inthecorpus, andthenumber of tokens. The former is calculated using the spaCy7 tokenizer. illustrates an annotated clinical note from our NER corpus. The phrase \" Diagnosticada con carcinoma duc-tal infiltrante de mama derecha \" contains four entities : cancer concept, cancer type, cancer expansion, and cancer location. It is important to note that identifying these named entities is only the first step. Subsequently, these medical entities are normalized to the UMLS vocabulary. In order to validate the NSSC, we introduce an in-house validation benchmark, called the Breast-Norm-Benchmark, which is constructed from the NER corpus described above. This benchmark includes each term from the NER corpus only once, meaning that duplicate terms are not repeated. This benchmark is described in and consists of 438 unique terms. These terms, along with their associated enti-ties, will be the context provided to the LLM. Below are two examples from the Breast-Norm-Benchmark : Text : \" cuadrante superior externo mama izquierda \" Context : \" Cancer Location \" CUIs : \" { ‘ C1266903 ’ } \" Text : \" mastectomía ahorradora \" Context : \" Surgery \" CUIs : \" { ‘ C0024881 ’, ‘ C1997268 ’ } \" During medical entity linking, we encounter the challenge that many UMLS terms are available only in English and not in Spanish. In our background knowledge-created using UMLS 2023AB – −25. 8 % of the terms are in English, while only 10. 8 % are in Spanish. To overcome this issue, we first search for the term in Spanish. If it is not found, we use the LLM to translate the term into English and then search for its corresponding English term in UMLS. Implementation NSSC is implemented in Python 3. 10. The source code is located in https : / / github","label":[[1160,1163,"MODEL"],[1784,1787,"MODEL"],[1445,1459,"TECHNIQUE"],[379,382,"TECHNIQUE"],[867,870,"TECHNIQUE"],[938,941,"TECHNIQUE"]],"Comments":[]}
