{"id":10,"text":"sions, and ( ii ) the implementation of a new strategy in contrastive learning that selects candidates more effectively, improving the training process. Further research has also adopted NED, focusing on a retrieve-and-rerank approach. Despite progress, the state of the art in NED reveals sev-eral research gaps and opportunities for further exploration. Traditional approaches using SVM and symbolic methods with KBs have made progress in disambiguating entities, especially in specific domains such as geography and short text fragments. However, these methods often struggle with complex or cross-domain scenarios where large LLMs and advanced neural methods, such as GNNs, show promise. There is still a need for more effective context handling, espe-cially in domain-specific applications such as medical texts. Recent techniques, like contrastive learning and improved homonym handling, represent steps forward, but further research is needed to improve the integration of domain-specific knowledge with general-purpose models, to increase the portability of these approaches across different domains, and to develop more robust methods for handling ambiguous entities in different contexts. 2. 4 Summary and gaps in existing research Several research gaps remain in NER, EL, and NED. Cur-rent deep learning models, while powerful, require large amounts of annotated data, which are often lacking in spe-cialized domains such as oncology. Meanwhile, KB-based approaches lack the contextual adaptability of DL models. Future research should focus on developing more robust hybrid models that combine the contextual understanding of deep learning with the specificity and interpretability of KB-based approaches. Additionally, there is a need for models that can better handle low-resource languages and domain-specific nuances, particularly in the biomedical domain. To solve the problem of oncologic entity linking, three approaches can be considered : Symbolic AI systems : These are rule-based systems that use syntactic or lexicographic rules from a KB. They pro-vide clear and understandable solution paths but struggle with variations in text mentions that differ from vocabu-lary labels, since concepts can be expressed in multiple ways, and the same word can have different meanings depending on the context. Sub-symbolic AI systems : These systems, often based on deep learning, require","label":[[385,388,"MODEL"],[584,591,"MODEL"],[1301,1314,"TECHNIQUE"],[1638,1651,"TECHNIQUE"],[2379,2392,"TECHNIQUE"],[58,78,"TECHNIQUE"],[842,862,"TECHNIQUE"],[1274,1277,"TECHNIQUE"],[1907,1921,"TECHNIQUE"],[70,78,"TECHNIQUE"],[1661,1672,"METRIC"]],"Comments":[]}
