{"id":25,"text":"a CoT prompt. An example of CoT is illustrated in In this example, we show how, by using the CoT prompt technique, the LLM can intelligently select the most appropriate CUI based on the contextual information pro-vided. The language model is required to justify its decision by explaining whether a suitable CUI exists ; if not, it should provide a translation of the term. In addition, each candidate is given the CUI, the label, the semantic group, and the defi-nition of the CUI is provided. Because UMLS often provides multiple definitions for each CUI, we give preference to the definitions provided by the NCI ( National Cancer Institute ) 6 6 https : / / www. cancer. gov / 123 762 Medical & Biological Engineering & Computing 63 : 749 – 772 Example for CoT prompt : a prompt to disambiguate the entity \" boost \" and context \" treatment name \" because it is a recognized and authoritative source of cancer-related information. 4. 5 Algorithmic complexity The time complexity of NSSC is determined by the sum of the time complexities of the three algorithms of which it is composed. Since NSSC takes a text input that is divided into an arbitrary number of tokens, the key parameters to consider for each module are as follows : NER : The BERT-based model must predict an entity for each token for a number of tokens. The preprocessing function time is minimal compared to the NER model. – s : Number of tokens is by divided the input text. – b : Number of neurons in the NER model. MEL : The BM25 algorithm has to compare all the terms in UMLS with the entities extracted from the previous step. Then, it has to filter the subset of candidates and decide whether to disambiguate or not. – r : Number of entities extracted from the text. – u : Number of terms in the UMLS. – k : Number of filtered candidates. MED : Apromptmustbecreatedforeachentitythatneeds to be disambiguated. This prompt is then processed by the LLM, which generates a response token by token. For each new token, all the neurons in the model must be computed. – l : Number of neurons in","label":[[1245,1255,"MODEL"],[119,122,"MODEL"],[1923,1926,"MODEL"],[1328,1341,"TECHNIQUE"],[1235,1238,"TECHNIQUE"],[1383,1386,"TECHNIQUE"],[1478,1481,"TECHNIQUE"]],"Comments":[]}
