{"id":9,"text":"-agnostic models, improving efficiency with large KBs, improving zero-shot learning, and better integrating symbolic reasoning with neural methods to address these challenges. 2. 3 Named entity disambiguation Named entity disambiguation ( NED ) is an NLP task that aims at resolving ambiguities arising from named entities in text. It can be considered as a subtask of EL, where NED is responsible for selecting the most appropriate candidate from a list generated for a mention in the text, based on context. The NED task has been a subject of investigation for some time. For example, proposed a method using a disam-biguation SVM kernel trained on an online encyclopedia to detect and disambiguate named entities in open domain text. 123 Medical & Biological Engineering & Computing 63 : 749 – 772 753 Novel approaches have been explored using large language models ( LLMs ) for disambiguating homonyms in academic KGs. Symbolic approaches utilizing KBs have been a signif-icant area of interest for NED tasks. For instance, addresses spatial NED by identifying and assigning precise coordinates to ambiguous place names in text. Additionally, focuses on applying NED to short text fragments in KGs, proposing an approach that includes context expansion with WordNet, coherence exploitation between entities, relation-based similarity calculation, and the use of syntactic features to improve the accuracy of query answering systems. In, a technique for integrating cross-domain data by transferring structural knowledge from a general text KB to the medical field significantly improved disambiguation per-formance on benchmark datasets such as MedMentions and BC5CDR. Supervised classification approaches that iden-tify informative keywords in the context of named entities have improved transferability. Graph Neural Networks ( GNNs ) such as GraphSAGE, R-GCN, and MAGNN achieve state-of-the-art results by representing entities as query graphs and employing effective negative sampling strategies. Recently, BELHD introduced two major improve-ments : ( i ) the extension of homonyms in the KB with unique disambiguating strings, ensuring unambiguous linking deci-","label":[[847,868,"MODEL"],[1849,1858,"MODEL"],[629,632,"MODEL"],[65,83,"TECHNIQUE"],[1975,1992,"TECHNIQUE"],[251,254,"TECHNIQUE"],[1400,1408,"METRIC"]],"Comments":[]}
