{"id":6,"text":"##dings. These inputs are processed by context encoders such as LSTM or RNN, and the outputs are decoded by tag decoders such as CRF. These approaches achieve high performance, with accuracy rates of up to 93. 5 % on the CoNLL-2003 dataset and 92. 07 % on the OntoNotes5. 0 dataset. Although NER has traditionally focused on identify-ing entities without explicit linking, recent advances have integrated knowledge bases ( KBs ) to improve entity recog-nition accuracy by leveraging pre-existing entries. However, this approach is more naturally aligned with the entity linking process, as discussed in Section2. 2. NER meth-ods based on KBs often have limitations compared to deep learning models, primarily due to their dependence on prede-fined databases, limited adaptability, and lack of contextual understanding. Conversely, deep learning models excel are characterized by scalability, contextual understanding, and automatic learning, resulting in more accurate and adaptive entityrecognition. However, theyrequirelargeannotatedcor-pora to perform effectively, which can be a significant barrier in specialized domains, such as breast cancer. There are specific cases where corpus annotation is unnec-essary, especially when the text is very similar to entries in the KB. In such scenarios, KB methodologies that incorpo-rate rule-based systems can be advantageous. For instance, proposes a novel approach to train NER models with-out labeled data, achieving a seven-point improvement in F1 scores on the CoNLL 2003 and Reuters / Bloomberg datasets. The use of NLP approaches to extract information from clinical texts has increased in recent years [ 29 – 31 ]. Specif-ically, within cancer-related clinical texts, models such as RoBERTa have demonstrated good performance, as shown by. While deep learning methods achieve high accu-racy and adaptability, they still struggle with domain-specific challenges, particularly when context is complex or the data is sparse. In contrast, NER methods using KBs lack the con-textual understanding and adaptability of DL models but can 123 752 Medical & Biological Engineering & Computing 63 : 749 – 772 be beneficial in specifi","label":[[1737,1744,"MODEL"],[1945,1952,"MODEL"],[64,68,"MODEL"],[72,75,"MODEL"],[563,577,"TECHNIQUE"],[677,690,"TECHNIQUE"],[831,844,"TECHNIQUE"],[1800,1813,"TECHNIQUE"],[1568,1571,"TECHNIQUE"],[292,295,"TECHNIQUE"],[616,619,"TECHNIQUE"],[1422,1425,"TECHNIQUE"],[1989,1992,"TECHNIQUE"],[182,190,"METRIC"],[460,468,"METRIC"],[1968,1974,"TECHNOLOGY"]],"Comments":[]}
