{"id":25,"text":"take into account the antisymmetric property and not consid-ered in this last assessment, has performances very stable with respect to the direct and inverse mutation, indicating that when a machine learning method is properly trained and when the antisymmetry is taken into account, it is possible to obtain consistent results for both direct and inverse variations. Problems and pitfalls in the sets of experimental data of protein mutations In addition to the weaknesses of the methods developed to predict the effect of mutations on protein stability, another main source of errors in this field is the lack of proper experimental data that can be used as a reference. Recently, two articles by Vihinen ’ s group evaluated in details the benchmark datasets used to train and test the predictors developed dur-ing the last 15 years. In particular, these authors focused on ProTherm, a database that collects published experimen-tally determined thermodynamic parameters of protein stability, because they pointed out that all the existing machine learning methods have been trained by using data extracted from this sin-gle database, publicly available through the VariBench database. Indeed, ProTherm contains not only thermodynamic data but also manually and automatically curated information on proteins, experimental methods and conditions, literature infor-mation, cross-links to structural information that facilitates the analysis of structure – thermodynamic relationship of proteins, as well as mutational information and is constantly updated by the curators. However, the deep analysis made by Vihinen and coworkers confirmed that the data contained in this resource and, as a consequence, in the sub-selections used to train the predictors are affected by several problems. First, none of these datasets is fully representative in describing the distribu-tion of protein folds, domains, enzyme classification, GO anno-tation levels and the distribution of the coding genes to chro-mosomes. Moreover, in ProTherm database, several G values were erroneously reported with respect to the original data, others were reported with the wrong unit, others were measured in unphysiological conditions ( extreme pressure, temperature, salt concentration etc. ), and others were data for unfolded pro-teins and for very short peptides. Furthermore, several data were incorrect with respect to the protein ’ s sequence or structure. In order to encompass all these limitations, Vihinen and cow","label":[[199,207,"TECHNIQUE"]],"Comments":[]}
