{"id":19,"text":"##D, I-Mutant 2. 0 and CC / PBSA ) were evaluated, together with Rosetta ( a method that was not tailored to predict stability of proteins ) and with an unpublished predictor devel-oped by the authors themselves. All these programs start from protein structure to predict changes in stability, introducing the mutations with different protocols. Mutations were classified following two criteria, being stabilizing / destabilizing and being or not hot spot mutations ( | G | > 2 kcal / mol ), and were divided in three classes ( mutations involving Gly and Pro, mutations to alanine and all other types of mutations ). In addition, two-state exposure to solvent was taken into account. Results were evaluated on the basis of the accuracy, sensitivity and specificity of each predictor. The average error in the prediction of G ( 1. 2 kcal / mol ) was found to be much higher than the experi-mental error, and all predictors were found to underestimate the experimental results. The percentage of mutations correctly identified as stabilizing or destabilizing varies among the differ-ent methods ( 69 – 79 % ). The best performing method was found to be EGAD, but this predictor was also the one with the highest number of unrealistic predictions, together with Rosetta. In that assessment CC / PBSA and I-Mutant 2. 0 were found to be the best programs in predicting a stabilizing or destabilizing effect for a mutation. Combining the results from different predictors did not improve the correctness of the output. In, 11 predictors, either sequence-or structure-based, were evaluated : Scpred, FoldX 3. 0, Dmutant, SCide, I-Mutant 2. 0 and 3. 0, SRide, MuPro 2. 0. 4, CUPSAT, MultiMutate and AUTO-MUTE, of which only two ( FoldX and I-Mutant 2. 0 ) were in common with the former study and three ( SCide, SRide and Scpred ) were able to predict only destabilizing effects caused by mutations. In this assessment, the statistical analysis to evaluate the quality of the prediction of the different tools was more thorough, and the authors took into account not only general results but also the performances of predictors with respect to the","label":[[738,749,"METRIC"],[754,765,"METRIC"],[728,736,"METRIC"]],"Comments":[]}
