{"id":13,"text":"tools start from the protein sequence, usually evo-lutionary information is taken into account by performing multi-ple sequence alignments, and also adding some kind of descrip-tion of the ‘ sequence environment ’ of the mutant residue, by using predictors of structural properties, such as the hydropho-bicity scores of wild-type and mutant residues and their molec-ular weights. Some predictors combine different methods to obtain multiple sequence alignments with structural sequence profiles obtained by low-resolution structure models, to provide more accurate information about the environment of the residue to be mutated. This enhances the robustness and accuracy of the predictor and makes it applicable to many more protein sequences. The same information is often integrated also in structure-based approaches. An interesting option offered by only a part of the methods is the opportunity of indicating temperature and pH values for the prediction. This option gives the chance to evaluate how the impact of substitution is different at changing temperature and pH, being the environmental conditions not unique in biological systems and, more in general, for possible protein engineering purposes. Another difference in the input / output of the methods con-cerns the opportunity to ask for the effect of single amino acid substitution ( the simpler case available in all predictors ) or a systematic substitution at a given position. While the effect of a selected amino acid substitution is of interest to evaluate natural variants observed in proteins, the systematic substitution is an information more suitable for protein engineering studies aimed to the design of modified proteins that retain or modify their stability properties, according to the specific purpose. To date, only one structure-based web server predictor, MAESTROweb is able to evaluate the effect not only of multiple mutations at the same position but also of multiple mutations occurring in different positions. Moreover, whereas the structure-based methods listed here can manage a single monomer at a time, MAESTROweb can deal even with multiple mutations occurring in different subunits of multimeric proteins. Problems and pitfalls in predicting the impact of missense mutations on protein ’ s thermodynamic stability Methods and tools to predict the effects of mutations on protein stability have been tested by their authors by analyzing different datasets. Additionally, the performances of several predictors among the most popular ones have been assessed several times in the last 10 years in an independent or semi-independent way [ 39, 61, 67, 70 – 75 ], naming as ‘","label":[[837,843,"MODEL"],[966,972,"MODEL"],[663,671,"METRIC"]],"Comments":[]}
