{"id":8,"text":". ics. uci. edu / I-Mutant 3. 0 Protein structure or sequence Temperature ; pH SVM-based web server, trained on a dataset derived from ProTherm G value and binary classification ( G 0, G < 0 ) or ternary classification ( G <-0. 5, −0. 5 G 0. 5, G > 0. 5 ) http : / / gpcr2. biocomp. unibo. it / cgi / predictors / I-Mutant3. 0 / I-Mutant3. 0. cgi mCSM Protein structure Single mutation, mutation list or systematic mutations on a single residue Graph-based distance patterns among atoms to represent the residue environment and a ‘ pharmacophore count ’ vector to account for the atom changes introduced by the mutation. The resulting signature vector is used to train predictive machine learning methods in regression and classification tasks Prediction of the direction of the change in stability and actual numerical experimental value. Also prediction of change in affinity of protein – protein and protein – DNA complexes upon mutation http : / / biosig. unimelb. edu. au / mcsm / NeEMO Protein structure Temperature ; pH ; amino acid to be substituted ( one or more, manually edited ) Calculation of residue – residue interaction networks where nodes represent residues and edges represent different types of physicochemical bonds. These graphs are used to train neural network for the prediction of stability changes Prediction of G changes upon point mutations http : / / protein. bio. unipd. it / neemo / Continued Downloaded from https : / / academic. oup. com / bib / article / 22 / 3 / bbaa074 / 5850907 by guest on 30 October 2025 Predicting the stability of mutant proteins by computational approaches : an overview 5 Continued Name and original reference Input data Input data and optional settings Type of approach Output Availability AUTO-MUTE 2. 0 ( Stability changes tool ) Protein structure ( no multiple models, no gaps ; no alternative conformations for alpha-carbon atoms ) Temperature ; pH ; amino acid to be substituted ( single or systematic ) Two supervised classification models ( random forest and SVM ) to predict only the sign of G ; two regression","label":[[2009,2022,"MODEL"],[79,82,"MODEL"],[2027,2030,"MODEL"],[917,926,"MODEL"],[688,696,"TECHNIQUE"]],"Comments":[]}
