{"id":11,"text":". pH value can be indicated Statistical energy functions complemented by additional sequence and structure information, combined with multiple linear regression, neural networks and SVM to generate a multi-agent method Predicted G values and a corresponding prediction confidence estimation https : / / biwww. che. sbg. ac. at / maestro / web DynaMut Protein structure Single mutations ; mutation list Meta-predictor : consensus among different predictors ( Bio3D, ENCoM and DUET ). The first two predictors are based on normal mode analysis of the conformational variability, the last one is a consensus method based on two approaches calculating statistical potentials Predicted change in stability along with the variation in entropy energy between wild-type and mutant structures provided for meta-predictor and for the structure-based methods http : / / biosig. unimelb. edu. au / dynamut / Downloaded from https : / / academic. oup. com / bib / article / 22 / 3 / bbaa074 / 5850907 by guest on 30 October 2025 Predicting the stability of mutant proteins by computational approaches : an overview 7 Most of the web servers listed in Tables 1 – 3 ask for the protein structure as an input, whereas some of them use only the sequence or combine the sequence / structure information for a better prediction. When the protein structure is taken as input, several structural parameters are derived from it, to describe the spatial environment of the residue subjected to mutation. In most cases, these parameters rely on the solvent accessible surface area ( SASA ) of the residue, and on the distance patterns or contacts among surrounding atoms, which act as descriptors of the volume of the cavity containing the candi-date residue for mutation. Some tools, such as AUTO-MUTE 2. 0 and SDM2, replace the evaluation of residue solvent accessibility with other parameters, such as the calculation of attributes derived by Delaunay tessellation ( for AUTO-MUTE ) or residue-occluding packing density and residue depth ( for SDM2 ). SDM2 introduces also the concept of ‘ functional residues ’ by identifying those residues involved in catalytic site, ligand binding and protein – protein interactions. In some other cases, for example, MUpro, CUPSAT and Po","label":[[182,185,"MODEL"],[143,160,"MODEL"],[729,736,"METRIC"]],"Comments":[]}
