{"id":26,"text":"##orkers have recently created a new, high-quality, cleaned dataset with the following criteria : data were added only for proteins with correct sequence and structure, using a single representative measurement made in physiological-like condi-tions ( pH between 5 and 9, low pressure, salt concentration lower than 0. 2 M ) and using the differential scanning calorimetry as a method of reference. This new database ( freely avail-able at http : / / structure. bmc. lu. se / VariBench / stability. php ) con-tains 1564 entries from 99 proteins from different organisms. Two hundred and thirty-three stabilizing and 864 destabilizing mutations are included, as well as 467 mutations that do not affect stability. Only 29 % of the entries of the original ProTherm database are present as such into this new resource, which is candidate to be the best suited one to test and train prediction methods. In our ongoing research, we are dealing with the effect of mutations in proteins involved in rare diseases, and we are continuously trying to improve the prediction of their effects on the stability [ 89 – 91 ]. In order to test the performances of several stability predictors to select the best one ( s ) for our current activi-ties ( manuscript in preparation ), we selected this new promising dataset, which can be considered the best curated one for this kind of applications. We focused on a subgroup of proteins with an explicit PDB reference, for a total of 78 proteins ( of which, 12 with associated NMR structure ) carrying globally 1432 mutations. Regrettably, despite the appreciable and remarkable effort made to create a cleaned reference database, we noticed that it is still far from being ideal. For example, this dataset includes five cytochrome, five lysozyme and five ribonuclease proteins from different organisms, meaning that almost 20 % of its content is related to only three different protein folds. The list of 172 mutations associated with Phage T4 lysozyme alone ( PDB code 2LZM ) accounts for more than 12 % of all the mutations in the subset analyzed. The mutations associated with other three proteins ( 130 to barnase form B. amyloliquefaciens, PDB file 1BNI ; 92 to Gene V protein from Enterobacteria phage f1, PDB file 1VQB ; and","label":[[352,360,"TECHNOLOGY"]],"Comments":[]}
