{"id":3,"text":"approach. The direct measurement of the impact of a large number of mutations on protein ’ s stability is usually not trivial to be made by experimental methods. Therefore, in order to overcome this limitation, many computational approaches have been devel-oped during the years to predict the thermodynamic stability changes of proteins upon mutations. In this review, we present an overview of the most recent or up-to-date freely available methods to predict protein ther-modynamic stability, and of their problems and pitfalls. We would like to point out that we have deliberately excluded from this review all those tools that predict the phenotypic effect of genetic variants ( for review, see, for example, ), since they include many other elements than stability to infer these effects, and therefore are beyond the scope of this work. Moreover, we have not even included here the analysis of the tools developed to predict the melting temperature ( Tm ) of the proteins. Indeed, the thermodynamic stability of a protein is correlated to its thermal stability, but the two terms indicate different aspects. Protein stability is described by the equilibrium of the unfolding reaction ( folded unfolded ). The G of protein unfolding varies nonlinearly with respect to temperature and can be described by a bell-shaped function ( Hence, the thermodynamic stability is the value of G at room temperature, whereas the thermal stability corresponds to the value of the Tm, i. e. the temperature at which G = 0. Information about tools that predict protein Tm can be found in. Computational approaches to predict the impact of missense mutations on protein ’ s thermodynamic stability The first example of theoretical calculations to predict the impact of mutations on protein ’ s stability appeared in literature in late 1980s. The method made free energy calculations using a semiempirical force field, starting from detailed atomic models of the protein structures. Being time-consuming, it was not suitable for large databases of mutations. Faster methods, based on more approximate descriptions of protein structures, simplified force field and a search in a limited conformational space, were developed later. In the 2000s, the landmark for this kind of algorithm was probably the work of Serrano ’ s group. FoldX empirical energy function, later implemented through a web server, combined several weighted energy terms developed to allow a fast and quantitative estimation of the difference in the free energy of unfolding ( G ) between","label":[],"Comments":[]}
