{"id":22,"text":"a machine learning approach that was trained with a database of mutations biased toward destabilizing effects. The performances of the methods were essentially unaffected by the structural change induced by the mutation, and similarly to the previous assessments, all methods performed best on exposed mutations with respect to buried ones. During 2018, two other assessments were made almost simultaneously. One was made essentially on the same programs analyzed in, except that FoldX 3. 0 was replaced by the more recent version 4. 0. Also the approach was the same as in the assessment made in 2012, but the authors used a larger database made by a set of PDB pairs of proteins which differ from 1 to 10 residues, collecting approximately 8000 pairs, at a resolution higher than 2. 5 Å, excluding proteins with missing backbone atoms and nonstandard residues. The authors measured the bias of the predictors as a function of the number of the mutations introduced and found, in agreement with, that all programs are biased for single substitutions, being FoldX the less biased and Rosetta the most biased one. The bias increases at increasing number of mutations, but the increment of the bias is less pronounced when multiple mutations are added. The other assessment performed in 2018 was made by the group developing PoPMuSiC predictor and is probably the most complete assessment made on this kind of tools so far. Fifteen widely used G predictors, of which five previously assessed ( CUPSAT, FoldX 3. 0, I-Mutant 3. 0, AUTO-MUTE, MUpro ) and the others more recently developed ( PoPMuSiC v. 2. 1 and PoPMuSiCsym, iSTABLE, NeEMO ; DUET, mCSM ; MAESTROweb ; STRUM ; SDM ), together with another version of Rosetta, were tested to quantify their bias in predicting the stability changes upon mutations. All were structure-based predictors except MUpro. The authors used the same assessment approach as in, but they calculated also the RMSD and linear correlation coefficient between predicted and experimental G values for the direct and inverse muta-tions in their reference dataset. The dataset used as a reference was formed by 684 mutations, half of which were direct muta-tions inserted in 15 wild-type proteins and the remaining half were inverse","label":[[10,18,"TECHNIQUE"]],"Comments":[]}
