{"id":20,"text":"struc-tural class of the protein, to the SASA and to the volume of the mutated residue. Moreover, this study classified the muta-tions in stabilizing mutations ( G < −0. 5 kcal / mol ), destabi-lizing mutations ( G > 0. 5 kcal / mol ) and neutral mutations ( −0. 5 < G < 0. 5 kcal / mol ), considering that the experimental error for measuring G was estimated as 0. 48 kcal / mol. Also in, the authors noticed that no program performed as well as reported by their authors and that there was no agreement in the predictions among the different programs. Matthew ’ s correlation coefficient ( MCC ) values calculated for the predictors were comprised between 0. 27 ( I-Mutant 3. 0 structure-based predictor ) and −0. 39 ( MUpro ). This range indicates a very poor result, considering that a value of MCC = 1 is associated with the best possible prediction, whereas values near 0 indicate ran-dom prediction. CUPSAT was found the method with the highest accuracy, sensitivity and MCC for stabilizing mutations, whereas I-Mutant 3. 0 ( structure-based predictor ), FoldX and Dmutant were the best methods to predict destabilizing effects of muta-tions. No significant differences were found among the pre-dictors with respect to the secondary structures in which the mutation is inserted, whereas CUPSAT, Dmutant, FoldX, I-Mutant 3. 0 and MultiMutate were the best predictors for proteins with few secondary structures. In addition, this assessment noted that there was generally no agreement among the predictors nor between the predictors and the experimental data. Downloaded from https : / / academic. oup. com / bib / article / 22 / 3 / bbaa074 / 5850907 by guest on 30 October 2025 12 Marabotti Li introduced hypothetical reversed mutations to test predictors of protein thermostability. Instead of comparing the performances of the predictors toward the ‘ true ’ experimen-tal G values, the authors tested the consistency of predictions between direct and inverse mutations. In this way, the limita-tions of the previous assessments due to inconsistencies in the G values obtained with different experimental","label":[[962,973,"METRIC"],[952,960,"METRIC"]],"Comments":[]}
