{"id":18,"text":"##ol as neutral Very small dataset. Evaluation of a tool ( PROVEAN ) that predicts whether a mutation is likely to be deleterious ( no direct prediction of G of mutations ) Provean scores have the strongest correlation with experimental DDG values. Amber TI predictions have the worst correlation ELASPIC has the lowest mean absolute error between predicted and experimental value ( MAE ), followed by FoldX. Rosetta ’ s cartesian _ ddg protocol has the highest MAE Provean has the highest Pearson ’ s r, followed by Rosetta ’ s cartesian _ ddg. Rosetta ’ s cartesian _ ddg has the highest balanced accuracy, Provean and Amber TI the worst The authors have developed ELASPIC program tested in the current assessment ∗The reader is recommended to refer to the original assessment article for further details. Downloaded from https : / / academic. oup. com / bib / article / 22 / 3 / bbaa074 / 5850907 by guest on 30 October 2025 Predicting the stability of mutant proteins by computational approaches : an overview 11 Continued Assessment Programs assessed Test set Metrics for assessment Problems and comments Summary of the results of the assessment∗ Conflict of interest Fang MUpro, I-Mutant 2. 0, STRUM, mCSM, DUET 125 mutations of 9 wild-type proteins in ProTherm database for which both wild-type and mutant protein structures were available Percent of inconsistence, percent of correctly predicted signs for direct and reverse mutations. Pearson ’ s and Fechner ’ s correlation coefficients of the experimental and predicted G. AUC curve for performance None reported All algorithms tested have a percent of inconsistency higher than 70 %, being mCSM the worst. All algorithms predicted the signs of forward mutations with accuracy higher than 80 % being MUpro the best, but the accuracy for reverse mutations was less than 30 %. Thus, all tested algorithms are prone to overfitting. Authors of the assessment are not involved as co-authors of the programs assessed ∗The reader is recommended to refer to the original assessment article for further details. uncertainty affects the highest possible accuracy that predictors may obtain, as it has been highlighted and addressed in two recent articles. In, four published predictors ( FoldX 3. 0, EGA","label":[[599,607,"METRIC"],[1729,1737,"METRIC"],[1785,1793,"METRIC"],[2105,2113,"METRIC"],[1534,1537,"METRIC"],[383,386,"METRIC"],[462,465,"METRIC"]],"Comments":[]}
