{"id":5,"text":"using the Tanford – Kirkwood Surface Accessibility model and the other one using an Ising-like statistical mechanical model. Web servers based on potential energy evaluation developed in the last 15 years are listed in The second ( and generally more recent ) approach deals with artificial intelligence-based methods such as support vector machines ( SVM ) and neural networks. These methods are usually trained onto a dataset of proteins associated with experimentally determined G, taking into account a set of descriptors of the sequence and / or structural features associated with the G. One of the first examples of this kind of approach has been the one developed by Capriotti and coworkers in 2004, later implemented in I-Mutant 2. 0. Since then, a high number of predictors based on machine learning approaches have been created, and those developed in the last 15 years and available as web servers are listed in The methods that apply the empirical energy function approach are usually computationally intensive and therefore difficult to be used for large datasets, whereas the machine learning approaches are usually more prone to overfitting problems. Additionally, some methods are more appropriately defined as meta-predictors, being based on the consensus among two or more methods. The web servers based on meta-predictors developed in the last 15 years are listed in Downloaded from https : / / academic. oup. com / bib / article / 22 / 3 / bbaa074 / 5850907 by guest on 30 October 2025 Predicting the stability of mutant proteins by computational approaches : an overview 3 List of methods to predict the thermodynamic stability changes of proteins upon mutations, based on calculation of free energy potentials, developed or updated in the last 15 years and freely available to users via web servers. All the web servers listed here were available at the time of the submission of the review Name and original reference Input data Optional settings Type of approach Output Availability SRide Protein structure – Structural parameters and evolutionary conservation score to find stabilizing centers Stabilizing residues in the protein structures http : / / sride. enzim. hu / CUPSAT Protein structure Experimental method : thermal or denaturants Prediction for one amino acid or all amino acids Structural environment-specific atom potentials and torsion angle potentials to calculate energy functions. Mutations and mean force potentials are classified according to different structural regions, including secondary structures and solvent access","label":[[352,355,"MODEL"],[801,809,"TECHNIQUE"],[2292,2296,"TECHNIQUE"],[2348,2352,"TECHNOLOGY"]],"Comments":[]}
