{"id":7,"text":"residues ) from the Ising-like WSME statistical mechanical model List of the top 5000 stable mutants with details on electrostatically frustrated residues and mutational hot spots ; optionally, unfolding curve in case of proteins with < 150 residues http : / / pbl. biotech. iitm. ac. in / pStab / pstab. php PoPMuSiCsym Protein structure – Linear combination of statistical potentials whose coefficients depend on the solvent accessibility of the mutated residue, correcting the bias toward destabilizing mutations imposing physical symmetries under inverse mutations Prediction of the change in folding free energy upon mutation ( G ). A negative sign corresponds to a mutation predicted as stabilizing http : / / www. dezyme. com / en / Software ( accessible to registered users only ; free of charge for academic users ) Downloaded from https : / / academic. oup. com / bib / article / 22 / 3 / bbaa074 / 5850907 by guest on 30 October 2025 4 Marabotti List of methods to predict the thermodynamic stability changes of proteins upon mutations based on machine learning approaches, developed or updated in the last 15 years and freely available to users via web servers. All the web servers listed here were available at the time of the submission of the review Name and original reference Input data Input data and optional settings Type of approach Output Availability I-Mutant 2. 0 Protein structure or sequence Temperature ; pH SVM-based web server, trained on a dataset derived from ProTherm Direction of the free energy change and its value for either all possible mutations of a particular residue or only for a specific mutation http : / / gpcr2. biocomp. unibo. it / cgi / predictors / I-Mutant2. 0 / I-Mutant2. 0. cgi MUpro Protein sequence. Protein structure if available – SVM-and neural network-based predictors, trained on the same dataset as I-Mutant 2. 0. Prediction of the value of energy change using support vector machine, using regression methods ( recommended ). Prediction of the sign of energy change using support vector machines and neural networks, using classification methods http : / / mupro. proteomics","label":[[1922,1944,"MODEL"],[1435,1438,"MODEL"],[1788,1791,"MODEL"],[1064,1072,"TECHNIQUE"]],"Comments":[]}
