{"id":17,"text":"Marabotti Continued Assessment Programs assessed Test set Metrics for assessment Problems and comments Summary of the results of the assessment∗ Conflict of interest Pucci PoPMuSiC 2. 1, PoPMuSiCsym, SDM, CUPSAT, Rosetta, FoldX 3. 0, I-Mutant 3. 0, iSTABLE, NeEMO, AUTO-MUTE, STRUM, MAESTRO, mCSM, DUET, MUpro Manually curated dataset obtained from ProTherm formed by 684 mutations, half of which are direct mutations inserted in 15 wild-type proteins and the remaining half are reverse mutations inserted in 342 different mutant proteins. The direct mutations belong to the training dataset of the methods tested, whereas the inverse mutations constitute an independent test set. 3D structures of both the wild-type and mutant proteins are solved by X-ray crystallography with a resolution < 2. 5 Å. G measured at T =, pH 7 RMSD and linear correlation coefficient between predicted and experimental G0 values for direct and reverse mutations. Linear correlation coefficient between the predicted G0 values of the direct and reverse mutations ( ideally, Gxy = −Gyx ) None reported All the tested methods are biased toward destabilizing mutations, except PoPMuSiCsym. SDM is the least biased predictor among the others Generally, the machine learning methods are more biased than physics-based approaches The best performing method for direct mutations is MUpro ; the best performing methods on inverse mutations are PoPMuSiCsym, MAESTRO, FoldX and PoPMuSiC 2. 1 The authors have developed PopMuSiCsym program tested in the current assessment Strokach Provean, ELASPIC, FoldX, Rosetta ddg _ monomer, Rosetta cartesian _ ddg, Amber TI Frataxin protein with eight mutants Mean absolute error between predicted and experimentally determined values, considering only those mutations with G < 4 kcal / mol Pearson ’ s and Spearman ’ s correlation coefficients. Balanced accuracy and AUC for ROC calculated considering mutations with an experimental G > 1 kcal / mol as destabilizing and mutations with an experimental G 1 kcal / m","label":[[1241,1249,"TECHNIQUE"],[1864,1872,"METRIC"],[1877,1880,"METRIC"],[753,756,"TECHNOLOGY"]],"Comments":[]}
