{"id":10,"text":"and other sequence-based protein features Predicted G of single-point mutation and predicted probability http : / / structure. bmc. lu. se / PON-Tstab / DeepDDG Protein structure Single mutations or a list of mutations Neural network-based predictor in which the parameters are shared for each target residue – neighbor residue pair Prediction of the change in folding free energy upon mutation ( G ) http : / / protein. org. cn / ddg. html Downloaded from https : / / academic. oup. com / bib / article / 22 / 3 / bbaa074 / 5850907 by guest on 30 October 2025 6 Marabotti List of methods to predict the thermodynamic stability changes of proteins upon mutations based on meta-approaches or mixed approaches, developed or updated in the last 15 years and freely available to users via web servers. All the web servers listed here were available at the time of the submission of the review Name and original reference∗ Input data Optional settings Type of approach Output Availability iStable Protein structure or sequence Temperature ; pH Meta-predictor : sequence information and prediction results from several elements predictors. SVM as an integrator Prediction of protein stability change http : / / predictor. nchu. edu. tw / istable / DUET Protein structure Single mutation or systematic Meta-predictor : consensus prediction of two complementary approaches developed by the same research group ( mCSM and SDM ) and obtained by combining the results using SVM Protein stability score http : / / biosig. unimelb. edu. au / duet / stability ELASPIC Protein structure Single mutation or multiple mutations Combination of semiempirical energy terms, sequence conservation and structural features to describe mutated position and its surroundings, with homology modeling to train ensemble machine learning methods based on decision trees Predicted G values of wild-type and mutant protein, predicted G value, structures of wild-type and mutant models, alignment file used to create the models http : / / elaspic. kimlab. org / MAESTROweb Protein structure Single mutation, mutation sensitivity profile, scan for ( de ) stabilizing mutations. Possibility to combine mutations in different positions and to take into account multimeric proteins","label":[[1134,1137,"MODEL"],[1463,1466,"MODEL"],[1954,1963,"MODEL"],[1799,1807,"TECHNIQUE"],[2084,2095,"METRIC"],[2105,2109,"TECHNOLOGY"]],"Comments":[]}
