{"id":5,"text":"##R algorithm on the 50 BCPSs were reviewed by an expert oncologist ( EK ) and inaccuracies were analyzed. Average F1-scores and number of attribute mentions were computed for the three main entities ( patient, side, lesion ), contextual information, and relation extraction. Subsequently, to assess the complete NLP pipeline, we automatically created patient profiles from the same set of 50 BCPSs, to be input in the GL-DSS, resulting in a set of recommendations ( Rauto ). This set of recommendations was compared to the recommendations provided by running the GL-DSS on the patient profiles manually created by a medical informatics intern with oncology expertise ( NN ), and considered as the gold standard ( RGS ). Recommendations from Rauto and RGS were automatically categorized as \" Identical, \" \" Different, \" or \" Comparable, \" where the latter encompassed partial matches or instances where recommendations from one method were subsumed by those from the other ( e. g., set 1 [ Lumpectomy ], set 2 [ Lumpectomy OR Oncoplasty ] ). 3. Results The NER algorithm achieved an average F1-score of 0. 90, 0. 89, and 0. 91 for the lesion entity on 2, 038 mentions, the side entity on 2, 187 mentions, and the patient entity on 226 mentions, respectively. An average F1-score of 0. 75 was computed for the contextual information extraction on 686 mentions and of 0. 87 for the relation extraction on 2, 021 mentions. The code for the NER and structured data extraction is available on GitHub ( https : / / github. com / akramRedjdal / FR _ BreastCancer _ NER ). displays the results of the comparison of Rauto and RGS. Thirty recommendations from Rauto were identical to RGS ( three of them were cases were the GL-DSS did not produce any recommendation ), 19 recommendations were comparable in Rauto and RGS, and one case was completely different with no RGS produced. Evaluation of the whole NLP pipeline and the GL-DSS. 4. Discussion and Conclusions The rule-based NER algorithm achieved an average F1-score of 0. 9 for the three main entities,","label":[[313,316,"TECHNIQUE"],[1896,1899,"TECHNIQUE"],[1057,1060,"TECHNIQUE"],[1437,1440,"TECHNIQUE"],[1558,1561,"TECHNIQUE"],[1970,1973,"TECHNIQUE"],[1091,1099,"METRIC"],[1270,1278,"METRIC"],[2004,2012,"METRIC"],[115,124,"METRIC"],[625,636,"TECHNOLOGY"]],"Comments":[]}
