{"id":6,"text":"which underscores the efficiency of rule-based methods in extracting significant patient data from BCPSs. However, we observed a notable decrease in F1-score for A. Redjdal / Leveraging Rule-Based NLP to Translate Textual Reports 1864 contextual information extraction ( 0. 75 ), specifically for family history and antecedents, indicating a potential area for improvement by integrating machine learning techniques to improve contextual understanding. In comparison with existing systems like RUBY, which employs a combination of deep learning ( DL ) and rule-based algorithms for information extraction in breast cancer reports, the method we proposed shows competitive performance, and in some cases was superior, in identifying key entities. This underscores the capacity of rule-based NER to rival or surpass more elaborate systems regarding accuracy and precision. During the evaluation of the complete NLP pipeline, 60 % ( 30 / 50 ) of treatment recommendations in Rauto matched the gold standard RGS, with three instances showing no recommendation from both methods due to information missing in the BCPSs. In cases classified as comparable ( 19 / 50 ), Rauto encompassed RGS on two instances due to oncoplasty and chemotherapy proposals ( proposed by Rauto and not by RGS ) based on tumor sizes inaccurately interpreted by the NER algorithm ( the sizes were actually distances between tumors in the text ). Conversely, RGS encompassed Rauto on three instances, highlighting two missed chemotherapy recommendations due to incorrect tumor size identification, and one missed lumpectomy contraindication due to an unobserved patient history. These findings underscore the critical need for accurate size extraction and confirms the need for better context analysis in NER approaches. Finally, one case had completely different recommendations, with the automated method erroneously recommending a treatment based on a misinterpretation of a family history of invasive cancer considered as a patient disease, pinpointing again a weakness in context detection. The limitations of this work come from the size of samples. The generalizability needs to be proven ( only breast cancer domain and BCPSs coming from one MTB ). In conclusion, with more than 66 % ( 30 + 3 ) of recommendations compliant with the GS, this work highlights the strengths of rule-based NLP methods in extracting data from BCPSs and points out the needs for better context understanding, suggesting the incorporation of machine learning","label":[[531,544,"TECHNIQUE"],[790,793,"TECHNIQUE"],[1336,1339,"TECHNIQUE"],[1774,1777,"TECHNIQUE"],[396,404,"TECHNIQUE"],[847,855,"METRIC"],[860,869,"METRIC"],[149,157,"METRIC"],[2054,2063,"TECHNOLOGY"]],"Comments":[]}
