{"id":4,"text":", the NER algorithm was applied to extract relevant attributes and values along with the contextual information. Additionally, date mentions were extracted for each section to build the patient timeline. Finally, a relation extraction algorithm was developed to identify meaningful connections between attributes and their entities. Two main relations were targeted : the hasSide relation to specify the laterality ( left, right, or bilateral ) of side attributes, and the isAttributeOf relation between tumor attributes and the tumor entity ( especially useful in case of multifocal breast cancers ). The goal of the relation extraction algorithm is to divide each section into sentences, then identify the side mention and / or the lesion mention in each sentence. The algorithm relates all tumor attributes in each sentence with the lesion mention in that sentence and links all the side attributes to the side mention. The two relations are represented in the BCKM ontology as object properties that link attributes to their entities. Structured data extraction pipeline. 2. 4. Automatic creation of BCKM-conformant patient profiles The next and final step was to map the extracted attributes to their corresponding concepts in the BCKM. This mapping process enabled the automatic creation of patient profiles that fit the GL-DSS format from data extracted from BCPSs. The workflow is as follows. Once significant patient data is extracted from specific sections, a postprocessing step is performed to resolve conflicts and prioritize most important information ( e. g., if clinical nodes status is positive in the MRI and negative in palpation, the algorithm prioritizes the positive status ). Finally, the inference module validates data completeness, ensuring the GL-DSS receives all necessary information, such as TNM classification and histologic type. The extracted data is formatted into a csv table, in compliance with HL7 FHIR standards for clinical data exchange and is used as input for existing algorithms developed within the DESIREE project that convert the table into a BCKM-translated patient instance, expressed as triplets in the N3 format. 2. 5. Evaluation The NLP algorithm was assessed according to two different methods performed on a sample of 50 randomly selected BCPSs, distinct from the 30 used for the annotation A. Redjdal / Leveraging Rule-Based NLP to Translate Textual Reports 1863 scheme development. First, the annotations provided by the NE","label":[[2184,2187,"TECHNIQUE"],[2379,2382,"TECHNIQUE"],[6,9,"TECHNIQUE"],[1739,1756,"METRIC"],[1168,1171,"METRIC"],[1506,1513,"TECHNOLOGY"]],"Comments":[]}
