{"id":3,"text":", and the lesion. Given that the ontology comprises over 1, 600 classes to cover the entire domain, we narrowed our focus to characteristics commonly observed in BCPSs, such as age and menopausal status for patient attributes, clinical node status, multifocality, or BI-RADS ( Breast Imaging-Reporting And Data System ) score for side attributes, histology, grade, or size information for tumor attributes. These selected features served as the groundwork for the subsequent phases of the study. 2. 2. Named entity recognition pipeline We first developed an annotation scheme in collaboration with two domain experts ( BS and JB ) to comprehensively capture the features previously selected for each entity within a randomized sample of 30 BCPSs. Then, we developed a named entity recognition ( NER ) algorithm adhering to the defined annotation scheme. The algorithm was designed to identify and tag the selected attributes and their values within BCPSs, by using a combination of tools. EDS-NLP ( https : / / aphp. github. io / edsnlp / latest / ), proposed by APHP-EDS, was used to extract dates, ICD10 codes and drug information, ClarityNLP ( https : / / github. com / ClarityNLP ) was used to extract tumor size and TNM staging, and the rest of attributes were extracted using handmade regular expressions ( RegEx ). The NER algorithm was then further improved to extract contextual information including negations, family history mentions and hypotheses ( e. g., a tumor is detected but there is no pathology result to confirm the cancer histology ). Finally, rules to refine regular expressions and specific patterns were built in accordance with the A. Redjdal / Leveraging Rule-Based NLP to Translate Textual Reports 1862 annotation scheme to ensure accurate identification and tagging of such contextual information within BCPSs. 2. 3. Structured data extraction After developing the NER algorithm to annotate attributes and their values, we built a structured data extraction pipeline to capture the significant patient information within BCPSs. This pipeline is made of several steps as illustrated in First, we identified the different sections within BCPSs using section markers or keywords based on both domain knowledge and how BCPS are usually structured. Once sections were identified","label":[[993,996,"TECHNIQUE"],[1693,1696,"TECHNIQUE"],[795,798,"TECHNIQUE"],[1326,1329,"TECHNIQUE"],[1894,1897,"TECHNIQUE"]],"Comments":[]}
