{"id":13,"text":"##em. 15 411 BC4CHEMD ( Krallinger, 2015 ) Drug / Chem. 79 842 BC2GM ( Smith, 2008 ) Gene / Protein 20 703 JNLPBA ( Kim, 2004 ) Gene / Protein 35 460 LINNAEUS ( Gerner, 2010 ) Species 4077 Species-800 ( Pafilis, 2013 ) Species 3708 Note : The number of annotations from Habibi and Zhu is provided. Statistics of the biomedical relation extraction datasets Dataset Entity type Number of relations GAD ( Bravo, 2015 ) Gene – disease 5330 EU-ADR ( Van Mulligen, 2012 ) Gene – disease 355 CHEMPROT ( Krallinger, 2017 ) Protein – chemical 10 031 Note : For the CHEMPROT dataset, the number of relations in the train-ing, validation and test sets was summed. Statistics of biomedical question answering datasets Dataset Number of train Number of test BioASQ 4b-factoid ( Tsatsaronis, 2015 ) 327 161 BioASQ 5b-factoid ( Tsatsaronis, 2015 ) 486 150 BioASQ 6b-factoid ( Tsatsaronis, 2015 ) 618 161 BioBERT 1237 Downloaded from https : / / academic. oup. com / bioinformatics / article / 36 / 4 / 1234 / 5566506 by guest on 30 October 2025 entities. While BERT often gives incorrect answers to simple bio-medical questions, BioBERT provides correct answers to such ques-tions. Also, BioBERT can provide longer named entities as answers. 6 Conclusion In this article, we introduced BioBERT, which is a pre-trained lan-guage representation model for biomedical text mining. We showed that pre-training BERT on biomedical corpora is crucial in applying it to the biomedical domain. Requiring minimal task-specific architectural modification, BioBERT outperforms previous models on biomedical text mining tasks such as NER, RE and QA. The pre-released version of BioBERT ( January 2019 ) has already been shown to be very effective in many biomedical text mining tasks such as NER for clinical notes ( Alsentzer, 2019 ),","label":[[1046,1050,"MODEL"],[1390,1394,"MODEL"],[889,896,"MODEL"],[1114,1121,"MODEL"],[1173,1180,"MODEL"],[1271,1278,"MODEL"],[1529,1536,"MODEL"],[1649,1656,"MODEL"],[1605,1608,"TECHNIQUE"],[1763,1766,"TECHNIQUE"],[327,346,"TECHNIQUE"],[316,346,"APPLICATION"],[678,696,"APPLICATION"],[745,751,"DATASET"],[793,799,"DATASET"],[841,847,"DATASET"]],"Comments":[]}
