{"id":6,"text":"on PubMed abstracts ( PubMed ) and PubMed Central full-text articles ( PMC ). The text corpora used for pre-training of BioBERT are listed in and the tested combinations of text corpora are listed in For computational efficiency, whenever the Wiki þ Books corpora were used for pre-training, we initialized BioBERT with the pre-trained BERT model provided by Devlin. We define BioBERT as a language representation model whose pre-training corpora includes biomedical corpora ( e. g. BioBERT ( þ PubMed ) ). For tokenization, BioBERT uses WordPiece tokenization ( Wu, 2016 ), which mitigates the out-of-vocabulary issue. With WordPiece tokenization, any new words can be represented by fre-quent subwords ( e. g. Immunoglobulin 1⁄4 > I # # mm # # uno # # g # # lo # # bul # # in ). We found that using cased vocabulary ( not lower-casing ) results in slightly better performances in downstream tasks. Although we could have constructed new WordPiece vocabulary based on biomedical corpora, we used the original vocabulary of BERTBASE for the following reasons : ( i ) compatibility of BioBERT with BERT, which allows BERT pre-trained on general domain cor-pora to be re-used, and makes it easier to interchangeably use exist-ing models based on BERT and BioBERT and ( ii ) any new words may still be represented and fine-tuned for the biomedical domain using the original WordPiece vocabulary of BERT. 3. 3 Fine-tuning BioBERT With minimal architectural modification, BioBERT can be applied to various downstream text mining tasks. We fine-tune BioBERT on the following three representative biomedical text mining tasks : NER, RE and QA. Named entity recognition is one of the most fundamental bio-medical text mining tasks, which involves recognizing numerous do-main-specific proper nouns in a biomedical corpus. While most previous works were built upon different combinations of LSTMs and CRFs ( Giorgi and Bader, 2018 ; Habibi, 2017 ; Wang, 2018 ), BERT","label":[[1024,1032,"MODEL"],[120,127,"MODEL"],[307,314,"MODEL"],[377,384,"MODEL"],[483,490,"MODEL"],[525,532,"MODEL"],[1084,1091,"MODEL"],[1253,1260,"MODEL"],[1418,1425,"MODEL"],[1467,1474,"MODEL"],[1544,1551,"MODEL"],[336,340,"MODEL"],[1097,1101,"MODEL"],[1116,1120,"MODEL"],[1244,1248,"MODEL"],[1395,1399,"MODEL"],[1953,1957,"MODEL"],[538,560,"TECHNIQUE"],[625,647,"TECHNIQUE"],[511,523,"TECHNIQUE"],[1406,1417,"TECHNIQUE"],[824,836,"TECHNIQUE"],[1621,1624,"TECHNIQUE"],[1590,1612,"APPLICATION"],[3,9,"DATASET"],[22,28,"DATASET"],[35,41,"DATASET"],[495,501,"DATASET"]],"Comments":[]}
