{"id":10,"text":"using both the PubMed and PMC corpora, we found that 200K and 270K pre-training steps were optimal for PubMed and PMC, respectively. We also used the ablated versions of BioBERT v1. 0, which were pre-trained on only PubMed for 200K steps ( BioBERT v1. 0 ( þ PubMed ) ) and PMC for 270K steps ( BioBERT v1. 0 ( þ PMC ) ). After our initial release of BioBERT v1. 0, we pre-trained BioBERT on PubMed for 1M steps, and we refer to this version as BioBERT v1. 1 ( þ PubMed ). Other hyper-parameters such as batch size and learning rate scheduling for pre-training BioBERT are the same as those for pre-training BERT unless stated otherwise. We pre-trained BioBERT using Naver Smart Machine Learning ( NSML ) ( Sung, 2017 ), which is utilized for large-scale experi-ments that need to be run on several GPUs. We used eight NVIDIA V100 ( 32GB ) GPUs for the pre-training. The maximum sequence length was fixed to 512 and the mini-batch size was set to 192, resulting in 98 304 words per iteration. It takes more than 10 days to pre-train BioBERT v1. 0 ( þ PubMed þ PMC ) nearly 23 days for BioBERT v1. 1 ( þ PubMed ) in this setting. Despite our best efforts to use BERTLARGE, we used only BERTBASE due to the computational complexity of BERTLARGE. We used a single NVIDIA Titan Xp ( 12GB ) GPU to fine-tune BioBERT on each task. Note that the fine-tuning process is more computationally efficient than pre-training BioBERT. For fine-tuning, a batch size of 10, 16, 32 or 64 was selected, and a learning rate of 5e5, 3e5 or 1e5 was selected. Fine-tuning BioBERT on QA and RE tasks took less than an hour as the size of the training data is much smaller than that of the training data used by Devlin. On the other","label":[[1184,1192,"MODEL"],[170,177,"MODEL"],[240,247,"MODEL"],[294,301,"MODEL"],[350,357,"MODEL"],[380,387,"MODEL"],[444,451,"MODEL"],[560,567,"MODEL"],[652,659,"MODEL"],[1032,1039,"MODEL"],[1084,1091,"MODEL"],[1302,1309,"MODEL"],[1410,1417,"MODEL"],[1548,1555,"MODEL"],[607,611,"MODEL"],[1338,1349,"TECHNIQUE"],[1423,1434,"TECHNIQUE"],[1536,1547,"TECHNIQUE"],[518,526,"TECHNIQUE"],[1566,1574,"APPLICATION"],[15,21,"DATASET"],[103,109,"DATASET"],[216,222,"DATASET"],[258,264,"DATASET"],[391,397,"DATASET"],[462,468,"DATASET"],[1050,1056,"DATASET"],[1102,1108,"DATASET"],[870,893,"ARCHITECTURE"],[1260,1275,"TECHNOLOGY"],[818,829,"TECHNOLOGY"],[697,701,"TECHNOLOGY"]],"Comments":[]}
