{"id":12,"text":"##medical QA data-sets, BioBERT achieved new state-of-the-art performance in terms of MRR. 5 Discussion We used additional corpora of different sizes for pre-training and investigated their effect on performance. For BioBERT v1. 0 ( þ PubMed ), we set the number of pre-training steps to 200K and var-ied the size of the PubMed corpus. shows that the per-formance of BioBERT v1. 0 ( þ PubMed ) on three NER datasets ( NCBI Disease, BC2GM, BC4CHEMD ) changes in relation to the size of the PubMed corpus. Pre-training on 1 billion words is quite effective, and the performance on each dataset mostly improves until 4. 5 billion words. We also saved the pre-trained weights from BioBERT v1. 0 ( þ PubMed ) at different pre-training steps to meas-ure how the number of pre-training steps affects its performance on fine-tuning tasks. shows the performance changes of BioBERT v1. 0 ( þ PubMed ) on the same three NER datasets in rela-tion to the number of pre-training steps. The results clearly show that the performance on each dataset improves as the number of pre-training steps increases. Finally, shows the absolute performance improvements of BioBERT v1. 0 ( þ PubMed þ PMC ) over BERT on all 15 datasets. F1 scores were used for NER / RE, and MRR scores were used for QA. BioBERT significantly improves per-formance on most of the datasets. As shown in we sampled predictions from BERT and BioBERT v1. 1 ( þPubMed ) to see the effect of pre-training on down-stream tasks. BioBERT can recognize biomedical named entities that BERT cannot and can find the exact boundaries of named Statistics of the biomedical named entity recognition datasets Dataset Entity type Number of annotations NCBI Disease ( Dogan, 2014 ) Disease 6881 2010 i2b2 / VA ( Uzuner, 2011 ) Disease 19 665 BC5CDR ( Li, 2016 ) Disease 12 694 BC5CDR ( Li, 2016 ) Drug / Ch","label":[[1184,1188,"MODEL"],[1385,1389,"MODEL"],[1529,1533,"MODEL"],[24,31,"MODEL"],[217,224,"MODEL"],[367,374,"MODEL"],[677,684,"MODEL"],[864,871,"MODEL"],[1146,1153,"MODEL"],[1276,1283,"MODEL"],[1394,1401,"MODEL"],[1476,1483,"MODEL"],[403,406,"TECHNIQUE"],[909,912,"TECHNIQUE"],[1233,1236,"TECHNIQUE"],[812,823,"TECHNIQUE"],[86,89,"METRIC"],[1247,1250,"METRIC"],[235,241,"DATASET"],[321,327,"DATASET"],[385,391,"DATASET"],[489,495,"DATASET"],[695,701,"DATASET"],[882,888,"DATASET"],[1164,1170,"DATASET"],[1736,1740,"DATASET"]],"Comments":[]}
