{"id":2,"text":"##medical relation extraction ( 2. 80 % F1 score improvement ) and biomedical question answering ( 12. 24 % MRR improvement ). Our analysis results show that pre-training BERT on biomedical corpora helps it to understand complex biomedical texts. Availability and implementation : We make the pre-trained weights of BioBERT freely available at https : / / github. com / naver / biobert-pretrained, and the source code for fine-tuning BioBERT available at https : / / github. com / dmis-lab / biobert. Contact : kangj @ korea. ac. kr 1 Introduction The volume of biomedical literature continues to rapidly increase. On average, more than 3000 new articles are published every day in peer-reviewed journals, excluding pre-prints and technical reports such as clinical trial reports in various archives. PubMed alone has a total of 29M articles as of January 2019. Reports containing valu-able information about new discoveries and new insights are con-tinuously added to the already overwhelming amount of literature. Consequently, there is increasingly more demand for accurate bio-medical text mining tools for extracting information from the literature. Recent progress of biomedical text mining models was made possible by the advancements of deep learning techniques used in natural language processing ( NLP ). For instance, Long Short-Term Memory ( LSTM ) and Conditional Random Field ( CRF ) have greatly improved performance in biomedical named entity recognition ( NER ) over the last few years ( Giorgi and Bader, 2018 ; Habibi, 2017 ; Wang, 2018 ; Yoon, 2019 ). Other deep learn-ing based models have made improvements in biomedical text min-ing tasks such as relation extraction ( RE ) ( Bhasuran and Natarajan, 2018 ; Lim and Kang, 2018 ) and question answering ( QA ) ( Wiese, 2017 ). V C The Author ( s ) 2019. Published by Oxford University Press. 1234 This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( http : / / creativecommons. org / licenses / by / 4. 0 / ), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited. Bioinformatics, 36, 2020, 1234 – 1240 Advance Access Public","label":[[1354,1358,"MODEL"],[171,175,"MODEL"],[316,323,"MODEL"],[378,385,"MODEL"],[434,441,"MODEL"],[492,499,"MODEL"],[1365,1389,"MODEL"],[221,228,"MODEL"],[1245,1258,"TECHNIQUE"],[1578,1588,"TECHNIQUE"],[1473,1476,"TECHNIQUE"],[10,29,"TECHNIQUE"],[1670,1689,"TECHNIQUE"],[422,433,"TECHNIQUE"],[1250,1258,"TECHNIQUE"],[108,111,"METRIC"],[78,96,"APPLICATION"],[1755,1773,"APPLICATION"],[801,807,"DATASET"]],"Comments":[]}
